[
    {
        "predicted_class": "C1",
        "prediction_confidence_level": "C1:53.2%, C2:44.63%, C3:2.17%",
        "feature_division": {
            "rank": [
                [
                    "F6",
                    0
                ],
                [
                    "F5",
                    1
                ],
                [
                    "F3",
                    2
                ],
                [
                    "F4",
                    3
                ],
                [
                    "F8",
                    4
                ],
                [
                    "F2",
                    5
                ],
                [
                    "F7",
                    6
                ],
                [
                    "F1",
                    7
                ]
            ],
            "contradict": [
                "F6",
                "F3",
                "F4",
                "F2"
            ],
            "support": [
                "F5",
                "F8"
            ],
            "ignore": [
                "F7",
                "F1"
            ]
        },
        "narration": "44.63%, 2.17%, and 53.2%, respectively, are the chances or likelihoods of any of the classes C2, C3, or C1 being the appropriate label for the case given here. Hence, it's safe to say that C1 is the most likely label for this situation and the values of the attributes or variables were taken into consideration to make the prediction choice. Specifically, while the features F5, F6, F3, F8, F4, and F2 are shown to have contributed to the decision, F1 and F7 are deemed irrelevant by the model. For the relevant features, F6, F3, F2, and F4 contributions suggest that C1 is likely not the true label, which explains why the predicted probability of C1 is only 53.2%. Conversely, the motivation to label the given case as C1 is mainly due to the positive contributions of F5 and F8 pushing the classification higher away from the alternative labels, C3 and C2."
    },
    {
        "predicted_class": "C2",
        "prediction_confidence_level": "C1:33.91%, C2:61.39%, C3:4.69%",
        "feature_division": {
            "rank": [
                [
                    "F8",
                    0
                ],
                [
                    "F14",
                    1
                ],
                [
                    "F16",
                    2
                ],
                [
                    "F13",
                    3
                ],
                [
                    "F2",
                    4
                ],
                [
                    "F3",
                    5
                ],
                [
                    "F4",
                    6
                ],
                [
                    "F7",
                    7
                ],
                [
                    "F9",
                    8
                ],
                [
                    "F12",
                    9
                ],
                [
                    "F15",
                    10
                ],
                [
                    "F17",
                    11
                ],
                [
                    "F5",
                    12
                ],
                [
                    "F10",
                    13
                ],
                [
                    "F6",
                    14
                ],
                [
                    "F11",
                    15
                ],
                [
                    "F1",
                    16
                ]
            ],
            "contradict": [
                "F8",
                "F16",
                "F13",
                "F3",
                "F4",
                "F7",
                "F12",
                "F15",
                "F5",
                "F6"
            ],
            "support": [
                "F14",
                "F2",
                "F9",
                "F17",
                "F10"
            ],
            "ignore": [
                "F11",
                "F1"
            ]
        },
        "narration": "The following are the prediction findings: At present, C2 has a 61.39 percent chance of being the correct label, while C1 has a 33.91 percent chance and C3 has a 4.69 percent chance. Therefore, C2 is the most likely label based on the predicted probabilities produced by the classification algorithm. Influencing the decision here are mainly the values of F8, F14, F16, F13, and F2. From the attribution investigation performed, the values of F3, F4, F7, and F9 have moderate contributions. The investigation also identified that the values of F1 and F11 are likely irrelevant, and hence have insignificant contribution to the algorithm's verdict with respect to the given case. Furthermore, while the values of F14, F2, F9, F17, and F10 are shown to positively improve the odds in favour of the C2 class, the values of features such as F8, F16, F13, F3, and F4 reduce the probability of the true label being C2. Together with other features F7, F12, F6, F5, and F15, the contributions of these negatives could explain why the predicted probability of C2 is only 61.39% while those of the remaining labels, C1 and C3, respectively, are 33.91% and 4.69%."
    },
    {
        "predicted_class": "C1",
        "prediction_confidence_level": "C1:46.03%, C2:22.4%, C3:31.57%",
        "feature_division": {
            "rank": [
                [
                    "F9",
                    0
                ],
                [
                    "F6",
                    1
                ],
                [
                    "F4",
                    2
                ],
                [
                    "F1",
                    3
                ],
                [
                    "F2",
                    4
                ],
                [
                    "F5",
                    5
                ],
                [
                    "F8",
                    6
                ],
                [
                    "F7",
                    7
                ],
                [
                    "F3",
                    8
                ],
                [
                    "F10",
                    9
                ]
            ],
            "contradict": [
                "F6",
                "F1",
                "F7"
            ],
            "support": [
                "F9",
                "F4",
                "F2",
                "F5",
                "F8",
                "F3"
            ],
            "ignore": [
                "F10"
            ]
        },
        "narration": "The classification assertions that follow are based on the case information provided to the prediction algorithm employed. Class C1 has a predicted probability of 46.03%, class C3 has a predicted probability of 31.57%, and class C2 has a predicted probability of only 22.4%. In a nutshell, it is correct to conclude that C1 is the most likely label. The label assignment is mainly based on the values of F6, F1, F9, F4, F2, F7, F5, F8, and F3 since the attribution analysis performed confirmed that F10 has an inconsiderable contribution to the algorithm's decision. The conducted investigation revealed that the features with positive contributions that supported the selection of C1 were F9, F4, F2, F3, F5, and F8. However, looking at the predicted probabilities across the class, it is easy to see that not all the features support the C1 assignment. Actually, the values of F1, F6, and F7 indicate that the true label could likely be either C3 or C2."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C4:45.0%, C1:17.4%, C2:31.57%, C3: 6.03%",
        "feature_division": {
            "rank": [
                [
                    "F10",
                    0
                ],
                [
                    "F6",
                    1
                ],
                [
                    "F4",
                    2
                ],
                [
                    "F1",
                    3
                ],
                [
                    "F2",
                    4
                ],
                [
                    "F5",
                    5
                ],
                [
                    "F8",
                    6
                ],
                [
                    "F7",
                    7
                ],
                [
                    "F3",
                    8
                ],
                [
                    "F11",
                    9
                ],
                [
                    "F9",
                    10
                ],
                [
                    "F13",
                    11
                ],
                [
                    "F12",
                    12
                ]

            ],
            "contradict": [
                "F10",
                "F6",
                "F1",
                "F7",
                "F11",
                "F9"
            ],
            "support": [
                
                "F4",
                "F2",
                "F5",
                "F8",
                "F3",
                "F13"

            ],
            "ignore": [
                "F12"
            ]
        },
        "narration": "The classification assertions that follow are based on the case information provided to the prediction algorithm employed. Class C4 has a predicted probability of 45.0%, Class C3's predicted probability is only 6.03%, Class C2 has a predicted probability of 31.57%, and Class C1 has a predicted probability of only 17.4%. In a nutshell, it is correct to conclude that C4 is the most likely label. The label assignment is mainly based on the values of F13, F1, F9, F4, F2, F7, F5, F8, F6, F11, F10, and F3 since the attribution analysis performed confirmed that F12 has an insignificant influence on the algorithm's decision. The attribution investigation suggested that the features with positive contributions or influence that supported the C4 assignment were F4, F2, F5, F8, F3, and F13. Considering the predicted probabilities across the classes, it is valid to say that not all the features support this C4 assignment. Actually, the values of F10, F6, F1, F7, F11, and F9 suggest that the true label could likely be either C3 or C1 or C2."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:1.52%, C2:2.31%, C3:16.31%, C4:79.86%",
        "feature_division": {
            "rank": [
                [
                    "F12",
                    0
                ],
                [
                    "F15",
                    1
                ],
                [
                    "F3",
                    2
                ],
                [
                    "F14",
                    3
                ],
                [
                    "F16",
                    4
                ],
                [
                    "F8",
                    5
                ],
                [
                    "F10",
                    6
                ],
                [
                    "F18",
                    7
                ],
                [
                    "F6",
                    8
                ],
                [
                    "F4",
                    9
                ],
                [
                    "F5",
                    10
                ],
                [
                    "F9",
                    11
                ],
                [
                    "F17",
                    12
                ],
                [
                    "F1",
                    13
                ],
                [
                    "F13",
                    14
                ],
                [
                    "F11",
                    15
                ],
                [
                    "F2",
                    16
                ],
                [
                    "F7",
                    17
                ]
            ],
            "contradict": [
                "F12",
                "F18",
                "F9",
                "F17"
            ],
            "support": [
                "F15",
                "F3",
                "F14",
                "F16",
                "F8",
                "F10",
                "F6",
                "F4",
                "F5",
                "F1"
            ],
            "ignore": [
                "F13",

                
                "F11",
                "F2",
                "F7"
            ]
        },
        "narration": "With such a high likelihood of 79.86 percent, the label for this case out of the four potential classes is judged to be C4. With a chance of around 16.31 percent, C3 is the next likely label. In contrast, the classifier is certain that neither C2 nor C1 is the true label and the aforesaid prediction output decision is primarily dependent on the variables or features presented to the classification algorithm. Conducting the attribution examination showed that the values of F13, F11, F2, and F7 have basically nothing to do with the decision to assign C4 to the given case. Conversely, the major contributors to the decision are the values of features such as F12, F15, F16, F3, and F14. The other notable contributors include F8, F10, F18, F6, and F4, whereas F5, F9, F17, and F1 are the least ranked among the influential features. Examining the feature attributions also indicated that the values of F12, F18, F9, and F17 can be blamed for the reduction in the odds of C4 being the true label since they contribute negatively contradicting the algorithm's choice. However, the push towards labelling the case as C4 is due to the positive contributions of features such as F15, F3, F14, F16, and F8."
    }
    ,
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:1.52%, C2:2.31%, C3:16.31%, C4:79.86%",
        "feature_division": {
            "rank": [
                [
                    "F12",
                    0
                ],
                [
                    "F15",
                    1
                ],
                [
                    "F3",
                    2
                ],
                [
                    "F14",
                    3
                ],
                [
                    "F16",
                    4
                ],
                [
                    "F8",
                    5
                ],
                [
                    "F10",
                    6
                ],
                [
                    "F18",
                    7
                ],
                [
                    "F6",
                    8
                ],
                [
                    "F4",
                    9
                ],
                [
                    "F5",
                    10
                ],
                [
                    "F9",
                    11
                ],
                [
                    "F17",
                    12
                ],
                [
                    "F1",
                    13
                ],
                [
                    "F13",
                    14
                ],
                [
                    "F11",
                    15
                ],
                [
                    "F2",
                    16
                ],
                [
                    "F7",
                    17
                ]
            ],
            "contradict": [
                "F12",
                "F18",
                "F9",
                "F17"
            ],
            "support": [
                "F15",
                "F3",
                "F14",
                "F16",
                "F8",
                "F10",
                "F6",
                "F4",
                "F5",
                "F1"
            ],
            "ignore": [
                "F13",
                "F11",
                "F2",
                "F7"
            ]
        },
        "narration": "The predicted probability that the label for this example is C4 is 79.86%. C3 is the next probable label, with a likelihood of roughly 16.31%, the classifier, on the other hand, is convinced that neither C2 nor C1 is a suitable label since they have the least respective likelihoods. The label choice or assignment is primarily based on the variables supplied to the classification algorithm and the attribution analysis revealed that the values of F13, F11, and F2 had nothing to do with the choice to allocate C4 to the given case. The values of variables such as F12, F15, F16, F3, and F14, on the other hand, are substantial factors in the conclusion that C4 is the right choice. F8, F10, F18, F6, and F4 are also key factors, whereas F5, F9, F17, and F1 are the least influential. Checking the attributions of the input variables also revealed that the values of F12, F18, F9, and F17 are responsible for the decrease in the likelihood of C4 being the correct label. These variables are referred to as negative features since their contributions contradict the algorithm's selection. However, the instance is labelled as C4 due to the positive contributions of variables like F15, F3, F14, F16, and F8. Besides, F10, F6, and F4 are also positive variables."
    },
    {
        "predicted_class": "C2",
        "prediction_confidence_level": "C1:29.31%, C2:40.86%, C3:13.26%, C4:16.57%",
        "feature_division": {
            "rank": [
                [
                    "F20",
                    0
                ],
                [
                    "F7",
                    1
                ],
                [
                    "F24",
                    2
                ],
                [
                    "F8",
                    3
                ],
                [
                    "F2",
                    4
                ],
                [
                    "F33",
                    5
                ],
                [
                    "F32",
                    6
                ],
                [
                    "F11",
                    7
                ],
                [
                    "F15",
                    8
                ],
                [
                    "F43",
                    9
                ],
                [
                    "F29",
                    10
                ],
                [
                    "F42",
                    11
                ],
                [
                    "F5",
                    12
                ],
                [
                    "F30",
                    13
                ],
                [
                    "F1",
                    14
                ],
                [
                    "F9",
                    15
                ],
                [
                    "F21",
                    16
                ],
                [
                    "F36",
                    17
                ],
                [
                    "F19",
                    18
                ],
                [
                    "F37",
                    19
                ],
                [
                    "F22",
                    20
                ],
                [
                    "F12",
                    21
                ],
                [
                    "F38",
                    22
                ],
                [
                    "F28",
                    23
                ],
                [
                    "F6",
                    24
                ],
                [
                    "F39",
                    25
                ],
                [
                    "F18",
                    26
                ],
                [
                    "F23",
                    27
                ],
                [
                    "F26",
                    28
                ],
                [
                    "F25",
                    29
                ],
                [
                    "F35",
                    30
                ],
                [
                    "F27",
                    31
                ],
                [
                    "F10",
                    32
                ],
                [
                    "F40",
                    33
                ],
                [
                    "F16",
                    34
                ],
                [
                    "F13",
                    35
                ],
                [
                    "F3",
                    36
                ],
                [
                    "F4",
                    37
                ],
                [
                    "F34",
                    38
                ],
                [
                    "F41",
                    39
                ],
                [
                    "F17",
                    40
                ],
                [
                    "F31",
                    41
                ],
                [
                    "F14",
                    42
                ]
            ],
            "contradict": [
                "F20",
                "F7",
                "F8",
                "F43",
                "F30",
                "F1",
                "F21",
                "F36",
                "F37",
                "F22",
                "F38",
                "F28",
                "F6",
                "F26",
                "F25",
                "F27",
                "F10"
            ],
            "support": [
                "F24",
                "F2",
                "F33",
                "F32",
                "F11",
                "F15",
                "F29",
                "F42",
                "F5",
                "F9",
                "F19",
                "F12",
                "F39",
                "F18",
                "F23",
                "F35"
            ],
            "ignore": [
                "F40",
                "F16",
                "F13",
                "F3",
                "F4",
                "F34",
                "F41",
                "F17",
                "F31",
                "F14"
            ]
        },
        "narration": "Considering the values of the input variables, the prediction algorithm labels the given case as C2 since it has the highest predicted probability of 40.86%, and the next most probable label, C1, is only 29.31% likely. Furthermore, the C3 and C4 labels have probabilities of 13.26% and 16.57%, respectively. The label choice is mainly due to the values of F20, F7, F24, F8, F2, and F33 since the attribution analysis identified them as the most influential variables considered by the model. According to the attributions assessment, the variables responsible for the reduction in the probability of the C2 label are mainly F20, F7, F8, F43, F30, and F1. The other negative variables include F21, F36, F37, F22, F38, and F28. What the negative variables suggest is that C1 or C4 or C4 could likely be the true label. However, this push towards the alternative labels is contradicted by the positive variables such as F24, F2, F33, F32, F11, and F15, resulting in the C2 assignment. F29, F42, F5, F9, F19, and F12 are some of the remaining variables with positive attributions pushing the decision in favour of the C2 label."
    },
    {
        "predicted_class": "C2",
        "prediction_confidence_level": "C1:29.31%, C2:40.86%, C3:13.26%, C4:16.57%",
        "feature_division": {
            "rank": [
                [
                    "F20",
                    0
                ],
                [
                    "F7",
                    1
                ],
                [
                    "F24",
                    2
                ],
                [
                    "F8",
                    3
                ],
                [
                    "F2",
                    4
                ],
                [
                    "F33",
                    5
                ],
                [
                    "F32",
                    6
                ],
                [
                    "F11",
                    7
                ],
                [
                    "F15",
                    8
                ],
                [
                    "F43",
                    9
                ],
                [
                    "F29",
                    10
                ],
                [
                    "F42",
                    11
                ],
                [
                    "F5",
                    12
                ],
                [
                    "F30",
                    13
                ],
                [
                    "F1",
                    14
                ],
                [
                    "F9",
                    15
                ],
                [
                    "F21",
                    16
                ],
                [
                    "F36",
                    17
                ],
                [
                    "F19",
                    18
                ],
                [
                    "F37",
                    19
                ],
                [
                    "F22",
                    20
                ],
                [
                    "F12",
                    21
                ],
                [
                    "F38",
                    22
                ],
                [
                    "F28",
                    23
                ],
                [
                    "F6",
                    24
                ],
                [
                    "F39",
                    25
                ],
                [
                    "F18",
                    26
                ],
                [
                    "F23",
                    27
                ],
                [
                    "F26",
                    28
                ],
                [
                    "F25",
                    29
                ],
                [
                    "F35",
                    30
                ],
                [
                    "F27",
                    31
                ],
                [
                    "F10",
                    32
                ],
                [
                    "F40",
                    33
                ],
                [
                    "F16",
                    34
                ],
                [
                    "F13",
                    35
                ],
                [
                    "F3",
                    36
                ],
                [
                    "F4",
                    37
                ],
                [
                    "F34",
                    38
                ],
                [
                    "F41",
                    39
                ],
                [
                    "F17",
                    40
                ],
                [
                    "F31",
                    41
                ],
                [
                    "F14",
                    42
                ]
            ],
            "contradict": [
                "F20",
                "F7",
                "F8",
                "F43",
                "F30",
                "F1",
                "F21",
                "F36",
                "F37",
                "F22",
                "F38",
                "F28",
                "F6",
                "F26",
                "F25",
                "F27",
                "F10"
            ],
            "support": [
                "F24",
                "F2",
                "F33",
                "F32",
                "F11",
                "F15",
                "F29",
                "F42",
                "F5",
                "F9",
                "F19",
                "F12",
                "F39",
                "F18",
                "F23",
                "F35"
            ],
            "ignore": [
                "F40",
                "F16",
                "F13",
                "F3",
                "F4",
                "F34",
                "F41",
                "F17",
                "F31",
                "F14"
            ]
        },
        "narration": "Based on the input variables' values, the prediction algorithm classifies the given case as C2 since it has the largest projected probability of 40.86 percent, whereas the next most likely label, C1, is only 29.31 percent probable. Additionally, the probability for the C3 and C4 labels are 13.26 percent and 16.57 percent, respectively. The label selection is mostly influenced by the values of F20, F24, F7, F8, F2, and F33, which were identified during the attribution investigation as the most relevant factors considered by the prediction algorithm. However, the values of features such as F40, and F16 have very little role in the label selection. From the attributions assessment, the features F20, F7, F8, F43, F30, F1, and F21 are marked as the negative variables since their contributions to the classification only lend themselves to pushing or steering the classification towards the alternative labels. Contradicting this negative influence on the algorithm are the top positive variables F24, F2, F33, and F32. The positive variables are the reasons why the algorithm outputs the label C2, but the moderate predicted probability is attributed to the contributions of the negative variables."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:6.18%, C2:13.24%, C3:3.41%, C4:77.17%",
        "feature_division": {
            "rank": [
                [
                    "F3",
                    0
                ],
                [
                    "F15",
                    1
                ],
                [
                    "F19",
                    2
                ],
                [
                    "F41",
                    3
                ],
                [
                    "F1",
                    4
                ],
                [
                    "F12",
                    5
                ],
                [
                    "F52",
                    6
                ],
                [
                    "F47",
                    7
                ],
                [
                    "F50",
                    8
                ],
                [
                    "F45",
                    9
                ],
                [
                    "F42",
                    10
                ],
                [
                    "F23",
                    11
                ],
                [
                    "F35",
                    12
                ],
                [
                    "F10",
                    13
                ],
                [
                    "F51",
                    14
                ],
                [
                    "F24",
                    15
                ],
                [
                    "F43",
                    16
                ],
                [
                    "F46",
                    17
                ],
                [
                    "F48",
                    18
                ],
                [
                    "F28",
                    19
                ],
                [
                    "F26",
                    20
                ],
                [
                    "F30",
                    21
                ],
                [
                    "F36",
                    22
                ],
                [
                    "F20",
                    23
                ],
                [
                    "F2",
                    24
                ],
                [
                    "F44",
                    25
                ],
                [
                    "F8",
                    26
                ],
                [
                    "F5",
                    27
                ],
                [
                    "F31",
                    28
                ],
                [
                    "F25",
                    29
                ],
                [
                    "F7",
                    30
                ],
                [
                    "F14",
                    31
                ],
                [
                    "F49",
                    32
                ],
                [
                    "F53",
                    33
                ],
                [
                    "F13",
                    34
                ],
                [
                    "F39",
                    35
                ],
                [
                    "F22",
                    36
                ],
                [
                    "F33",
                    37
                ],
                [
                    "F18",
                    38
                ],
                [
                    "F34",
                    39
                ],
                [
                    "F40",
                    40
                ],
                [
                    "F4",
                    41
                ],
                [
                    "F27",
                    42
                ],
                [
                    "F21",
                    43
                ],
                [
                    "F37",
                    44
                ],
                [
                    "F29",
                    45
                ],
                [
                    "F6",
                    46
                ],
                [
                    "F9",
                    47
                ],
                [
                    "F11",
                    48
                ],
                [
                    "F17",
                    49
                ],
                [
                    "F38",
                    50
                ],
                [
                    "F32",
                    51
                ],
                [
                    "F16",
                    52
                ]
            ],
            "contradict": [
                "F1",
                "F45",
                "F23",
                "F35",
                "F24",
                "F43",
                "F46",
                "F48",
                "F28",
                "F26",
                "F20",
                "F8",
                "F25",
                "F14",
                "F49",
                "F13",
                "F39",
                "F22",
                "F18"
            ],
            "support": [
                "F3",
                "F15",
                "F19",
                "F41",
                "F12",
                "F52",
                "F47",
                "F50",
                "F42",
                "F10",
                "F51",
                "F30",
                "F36",
                "F2",
                "F44",
                "F5",
                "F31",
                "F7",
                "F53",
                "F33",
                "F34"
            ],
            "ignore": [
                "F40",
                "F4",
                "F27",
                "F21",
                "F37",
                "F29",
                "F6",
                "F9",
                "F11",
                "F17",
                "F38",
                "F32",
                "F16"
            ]
        },
        "narration": "With a probability of roughly 77.17%, the predictive algorithm identifies the case under evaluation as C4 but, there is a 13.24% probability of the true label being C2. Furthermore, because C1 and C3 have the lowest prediction probabilities, the algorithm is certain that they are not the actual labels. Across all the input variables, the attributions of features such as F3, F15, F19, F41, F1, F12, F52, F47, F50, F45, F42, F35, and F23. Among these influential features, only F1, F45, F23, and F35 are shown to have negative contributions responsible for the decrease in the predictability of the assigned label. On the contrary, the positive contributions of F3, F15, F19, and F41 strongly support labelling the case under consideration as C4. Finally, the values of F40, F4, F27, and F21 are among the features identified as irrelevant to the labelling decision-making here."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C4:56.15%, C2:9.42%, C3:13.44%, C1:20.99%",
        "feature_division": {
            "rank": [
                [
                    "F8",
                    0
                ],
                [
                    "F15",
                    1
                ],
                [
                    "F6",
                    2
                ],
                [
                    "F2",
                    3
                ],
                [
                    "F3",
                    4
                ],
                [
                    "F7",
                    5
                ],
                [
                    "F14",
                    6
                ],
                [
                    "F5",
                    7
                ],
                [
                    "F16",
                    8
                ],
                [
                    "F9",
                    9
                ],
                [
                    "F1",
                    10
                ],
                [
                    "F10",
                    11
                ],
                [
                    "F4",
                    12
                ],
                [
                    "F13",
                    13
                ],
                
                [
                    "F12",
                    14
                ],
                
                [
                    "F19",
                    15
                ],
                [
                    "F11",
                    16
                ]
                ,
                [
                    "F17",
                    17
                ]
                ,
                [
                    "F18",
                    18
                ]
            ],
            "contradict": [
                "F15",
                "F2",
                "F3",
                "F14",
                "F16",
                "F9",
                "F4",
                "F11",
                "F17",
                "F19"

            ],
            "support": [
                "F8",
                "F6",
                "F7",
                "F5",
                "F1",
                "F10",
                "F12",
                "F13",
                "F18"
            ],
            "ignore": [
                
            ]
        },
        "narration": "Concluding on the label choice based on the values of the input variables, the classification model labelled the case as C4 since its predicted probability is higher than the other possible labels. According to the attribution analysis, the most influential features are F8, F15, F6, F2, and F3. Those with moderate contributions are F7, F14, F5, F16, F9, and F1, whereas the least ranked features are F11, F17, and F18. Per the attribution assessment, the values of F15, F2, F3, F14, F16, and F9 are the main negative contributors, pulling the decision in a totally different direction than the assigned label. Together with other nagatives, F4, F11, F17, and F19, they support labelling the case with a different label. Contradicting the negative contributions and pushing the narrative in favour of the C4, the positive features F8, F6, F7, F5, F1, F10, F12, F13, and F18. The competition between the negatives and positives explains why the predicted probability of C4 is only 56.15% while those of C1, C2, and C3, respectively, are 20.99%, 9.42%, and 13.44%."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:5.87%, C2:5.48%, C3:25.54%, C4:63.11%",
        "feature_division": {
            "rank": [
                [
                    "F2",
                    0
                ],
                [
                    "F7",
                    1
                ],
                [
                    "F5",
                    2
                ],
                [
                    "F18",
                    3
                ],
                [
                    "F11",
                    4
                ],
                [
                    "F9",
                    5
                ],
                [
                    "F13",
                    6
                ],
                [
                    "F12",
                    7
                ],
                [
                    "F14",
                    8
                ],
                [
                    "F13",
                    9
                ],
                [
                    "F22",
                    10
                ],
                [
                    "F15",
                    11
                ],
                [
                    "F10",
                    12
                ],
                [
                    "F3",
                    13
                ],
                [
                    "F4",
                    14
                ],
                [
                    "F1",
                    15
                ],
                [
                    "F8",
                    22
                ],
                [
                    "F16",
                    16
                ],
                [
                    "F19",
                    17
                ],
                [
                    "F6",
                    18
                ],
                [
                    "F17",
                    19
                ],
                [
                    "F20",
                    20
                ],
                [
                    "F21",
                    21
                ]
            ],
            "contradict": [
               
                "F11",
                "F9",
                "F10",
                "F8",
                "F13",
                "F16",
                "F19"
            ],
            "support": [
                "F2",
                "F7",
                "F5",
                "F18",
                "F3",
                "F4",
                "F6",
                "F1",
                "F15",
                "F14",
                "F12"
            ],
            "ignore": [
                "F17",
                "F20",
                "F21"
            ]
        },
        "narration": "Regarding the given case, the model generates C4 as the most likely class since its predicted probability is 63.11%, which is higher than all the other classes. Based on the predicted probabilities, it can be concluded that C1 and C2 have very little chance of being the true labels, whereas the likelihood of C3 is only 25.54%, making it the next probable label. The model's decision is heavily influenced by the values of F2, F7, F5, F18, and F11. But the values of F20, F21, and F17 are likely ignored by the model when deciding which label is most appropriate for the given case simply because they have attributions very close to zero. Pushing the model towards the alternative classes are the features F11, F9, F10, F8, F13, F16, and F19 with their negative contributions. In essence, the 63.11% confidence level in the decision is due to the strong positive influence of F2, F7, F5, and F18 while the remaining positive features are F3, F4, F6, F1, F15, F14, and F12."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:0.0%, C3:2.39%, C2:9.45%, C4:88.16%",
        "feature_division": {
            "rank": [
                [
                    "F42",
                    0
                ],
                [
                    "F36",
                    1
                ],
                [
                    "F2",
                    2
                ],
                [
                    "F13",
                    3
                ],
                [
                    "F4",
                    4
                ],
                [
                    "F46",
                    5
                ],
                [
                    "F16",
                    6
                ],
                [
                    "F51",
                    7
                ],
                [
                    "F23",
                    8
                ],
                [
                    "F26",
                    9
                ],
                [
                    "F24",
                    10
                ],
                [
                    "F31",
                    11
                ],
                [
                    "F8",
                    12
                ],
                [
                    "F32",
                    13
                ],
                [
                    "F38",
                    14
                ],
                [
                    "F5",
                    15
                ],
                [
                    "F7",
                    16
                ],
                [
                    "F29",
                    17
                ],
                [
                    "F18",
                    18
                ],
                [
                    "F49",
                    19
                ],
                [
                    "F48",
                    20
                ],
                [
                    "F43",
                    21
                ],
                [
                    "F40",
                    22
                ],
                [
                    "F11",
                    23
                ],
                [
                    "F50",
                    24
                ],
                [
                    "F37",
                    25
                ],
                [
                    "F9",
                    26
                ],
                [
                    "F53",
                    27
                ],
                [
                    "F33",
                    28
                ],
                [
                    "F47",
                    29
                ],
                [
                    "F39",
                    30
                ],
                [
                    "F41",
                    31
                ],
                [
                    "F35",
                    32
                ],
                [
                    "F10",
                    33
                ],
                [
                    "F28",
                    34
                ],
                [
                    "F20",
                    35
                ],
                [
                    "F44",
                    36
                ],
                [
                    "F45",
                    37
                ],
                [
                    "F15",
                    38
                ],
                [
                    "F6",
                    39
                ],
                [
                    "F25",
                    40
                ],
                [
                    "F19",
                    41
                ],
                [
                    "F27",
                    42
                ],
                [
                    "F22",
                    43
                ],
                [
                    "F14",
                    44
                ],
                [
                    "F3",
                    45
                ],
                [
                    "F21",
                    46
                ],
                [
                    "F34",
                    47
                ],
                [
                    "F52",
                    48
                ],
                [
                    "F30",
                    49
                ],
                [
                    "F17",
                    50
                ],
                [
                    "F12",
                    51
                ],
                [
                    "F1",
                    52
                ]
            ],
            "contradict": [
                
                "F13",
                "F4",
                "F26",
                "F8",
                "F32",
                "F18",
                "F49",
                "F48",
                "F43",
                "F50",
                "F37",
                "F33",
                "F6"
            ],
            "support": [
                "F42",
                "F2",
                "F36",
                "F46",
                "F16",
                "F51",
                "F23",
                "F24",
                "F31",
                "F38",
                "F5",
                "F7",
                "F29",
                "F40",
                "F11",
                "F9",
                "F53",
                "F47",
                "F39",
                "F41",
                "F35",
                "F10",
                "F28",
                "F20",
                "F44",
                "F45",
                "F15"
            ],
            "ignore": [
                "F25",
                "F19",
                "F27",
                "F22",
                "F14",
                "F3",
                "F21",
                "F34",
                "F52",
                "F30",
                "F17",
                "F12",
                "F1"
            ]
        },
        "narration": "Regarding the given case, the prediction model outputs C4 as the most likely class with a very high prediction confidence of 88.16%, far higher than all the other possible classes. Judging based on the predicted likelihoods, it can be concluded that the model is 100.0% certain that C1 is not the true label, whereas C2 and C3 each have very little chance of being the true label. The classification decision is primarily influenced by the values of F42, F36, F2, F13, F46, and F4. But inspecting the attributions of the features showed that the values of features such as F25, F19, and F27 are irrelevant when it comes to deciding which label is more appropriate for the given case. Driving the model towards outputting one of the alternative classes are the features such as F13, F4, F26, F8, F32, F18, F43, F50, F49, and F48 with their negative contributions. In a nutshell, the 88.16% confidence level in the decision is due to the higher positive influence of F42, F2, F36, F46, F51, F23, F24, F31, and F16."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C1:9.35%, C2:11.71%, C3:58.15%, C4:20.79%",
        "feature_division": {
            "ranks": [
                [
                    "F4",
                    0
                ],
                [
                    "F14",
                    1
                ],
                [
                    "F11",
                    2
                ],
                [
                    "F13",
                    3
                ],
                [
                    "F16",
                    4
                ],
                [
                    "F15",
                   5
                ],
                [
                    "F12",
                    6
                ],
                [
                    "F9",
                    7
                ],
                [
                    "F10",
                    8
                ],
                [
                    "F6",
                    9
                ],
                [
                    "F17",
                    10
                ],
                [
                    "F5",
                    11
                ],
                [
                    "F2",
                    12
                ],
                [
                    "F18",
                    13
                ],
                [
                    "F1",
                    14
                ],
                [
                    "F3",
                    15
                ],
                [
                    "F8",
                    16
                ]
                ,
                [
                    "F7",
                    17
                ]
            ],
            "contradict": [
                "F11",
                "F9",
                "F10",
                "F1",
                "F18",
                "F12",
                "F17",
                "F15",
                "F3"
                
            ],
            "support": [
                "F4",
                "F14",
                "F6",
                "F5",
                "F2",
                "F13",
                "F16"
                
               
                
            ],
            "ignore": [
                "F7","F8" 
            ]
        },
        "narration": "With all the input features, except F8 and F7, shown to have varying levels of influence on the labelling decision, the prediction algorithm labels the given case as C3. This is mainly due to the fact that C3 has the highest predictive likelihood which is equal to 58.15% among the four possible classes. The predicted probabilities of C1, C4, and C2, respectively, are equal to 9.35%, 20.79%, and 11.71%. By digging deeper, it is revealed that the features positively contributing to this classification are F4, F14, F6, F5, F2, F13, and F16. F11, F9, F10, F1, F18, F12, F17, F15, and F3, on the other hand, are the negative features that push the classification verdict in a different direction. These negatives favour or support labelling the case as one of the alternative possible labels explaining why the confidence level with respect to the decision here is moderate."
    },
    {
        "predicted_class": "C1",
        "prediction_confidence_level": "C1:84.11%, C2:7.8%, C3:4.39%, C4:3.7%",
        "feature_division": {
            "ranks": [
                [
                    "F11",
                    0
                ],
                [
                    "F5",
                    1
                ],
                [
                    "F8",
                    2
                ],
                [
                    "F4",
                    3
                ],
                [
                    "F15",
                    4
                ],
                [
                    "F7",
                    5
                ],
                [
                    "F17",
                    6
                ],
                [
                    "F6",
                    7
                ],
                [
                    "F1",
                    8
                ],
                [
                    "F16",
                    9
                ],
                [
                    "F9",
                    10
                ],
                [
                    "F3",
                    11
                ],
                [
                    "F13",
                    12
                ],
                [
                    "F14",
                    13
                ],
                [
                    "F2",
                    14
                ],
                [
                    "F12",
                    15
                ],
                [
                    "F18",
                    16
                ],
                [
                    "F10",
                    17
                ]
            ],
            "contradict": [
                "F8",
                "F7",
                "F6",
                "F16",
                "F9",
                "F3",
                "F14",
                "F18",
                "F10"
            ],
            "support": [
                "F11",
                "F5",
                "F4",
                "F15",
                "F17",
                "F1",
                "F13",
                "F2",
                "F12"
            ],
            "ignore": [
               
            ]
        },
        "narration": "The model classifies the given case as C1 with an 84.11 percent degree of confidence. This is due to the fact that the remaining classes, C2, C4, and C3, have likelihoods of 7.8 percent, 3.7 percent, and 4.39 percent, respectively and the aforementioned prediction outputs are primarily attributed to the contributions of the input variables. The variables with the most influence are F11, F8, F5, F4, and F15, whereas F18, F12, and F10 are the least ranked contributors. Even though the model has a higher confidence that C1 is the true label, the values of negative variables such as F8, F7, F6, F16, and F9, argue for a different label. The other negatives are F3, F14, F18, and F10. Principally, the high confidence in the assigned label is attributed to the influence of the positive variables F11, F5, F4, F15, F13, and F17."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:24.44%, C2:18.45%, C3:3.55%, C4:53.56%",
        "feature_division": {
            "ranks": [
                [
                    "F3",
                    0
                ],
                [
                    "F5",
                    1
                ],
                [
                    "F20",
                    2
                ],
                
                [
                    "F2",
                    3
                ],
                [
                    "F7",
                    4
                ],
                [
                    "F9",
                    5
                ],
                [
                    "F6",
                    6
                ],
               
                [
                    "F10",
                    7
                ],
                [
                    "F4",
                    8
                ],
                [
                    "F1",
                    9
                ],
                [
                    "F12",
                    10
                ],
                [
                    "F11",
                    11
                ],
                [
                    "F13",
                    12
                ]
                ,
                [
                    "F15",
                    13
                ],
                [
                    "F14",
                    14
                ],
                [
                    "F18",
                    15
                ],
                [
                    "F16",
                    16
                ],
                [
                    "F19",
                    17
                ],
                [
                    "F17",
                    18
                ],
                [
                    "F21",
                    19
                ],
                [
                    "F8",
                    20
                ]
            ],
            "contradict": [
                "F5",
                "F2",
                "F9",
                "F12",
                "F11",
                "F15",
                "F14",
                "F19",
                "F21",
                "F8"
            ],
            "support": [
                "F3",
                "F20",
                "F6",
                "F7",
                "F10", 
                "F4",
                "F1",
                "F13",
                "F16",
                "F18",
                "F17"
                
            ],
            "ignore": [
               
            ]
        },
        "narration": "The classification output with respect to the case under consideration is C4 and it has a predicted confidence of 53.56%. Since C1, C2, and C3 have lower predicted probabilities than C4, it is valid to conclude that neither of them is the true label. The degree of certainty in the prediction decision made here is attributed to the impact of the different input features considered. According to the attribution evaluations, the most relevant features are F3, F5, F20, F2, F7, and F9. Contrariwise, F17, F21, and F8 are identified as the least influential features. The evaluations also revealed that the features F5, F2, F9, F12, F11, F15, F14, F19, F21, and F8 have negative contributions, resulting in a reduction in the model's confidence in the assignment of the C4 label. The decision to label the case is due to the positive features contradicting the influence of the negative features. The positive features identified are F3, F20, F6, F7, F10, F4, F1, F13, F16, F18, and F17."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C4:24.24%, C2:6.5%, C3:64.26%, C1:5.0%",
        "feature_division": {
            "ranks": [
                [
                    "F12",
                    0
                ],
                [
                    "F11",
                    1
                ],
                [
                    "F2",
                    2
                ],
                [
                    "F9",
                    3
                ],
                [
                    "F8",
                    4
                ],
                [
                    "F1",
                    5
                ],
                [
                    "F13",
                    6
                ],
                [
                    "F7",
                    7
                ],
                [
                    "F5",
                    8
                ],
                [
                    "F10",
                    9
                ],
                [
                    "F4",
                    10
                ],
                [
                    "F14",
                    11
                ],
                [
                    "F3",
                    12
                ],
                [
                    "F6",
                    13
                ]
            ],
            "contradict": [
                "F8",
                "F1",
                "F7",
                "F5",
                "F4",
                "F14"
            ],
            "support": [
                "F12",
                "F11",
                "F2",
                "F9",
                "F13",
                "F10"
            ],
            "ignore": [
                "F3",
                "F6"
            ]
        },
        "narration": "The classification findings are: the probability that C3 is the correct label is 64.26%, the probability that C4 is the correct label is 24.24%, and the probability that C2 is the correct label is 6.5%, while that of C1 is only 5.0%. From the predicted likelihoods of the classes, C3 was chosen as the most likely one. Confidence in the algorithm's label choice is attributed to the varying degrees of input feature contributions. The feature attribution analysis performed indicates that the values of F6 and F3 are probably not taken into consideration in the decision making here. Conversely, the influential features can be ranked as follows: F12, F11, F2, F9, F8, F1, F13, F7, F5, F10, F4, F14. The predicted probability of C3 is only 64.26% due to the negative contributions of F8, F1, F7, F5, F4, and F14, since these features' attributions steer the verdict away from the C3 label. Positive features F12, F11, F2, F9, F13, and F10 push the prediction closer to the C3 label. On account of the fact that the top features F12, F11, F2, and F9 are all positive, it is not surprising that C3 has a fairly high predicted probability."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:26.01%, C2:4.14%, C3:12.80, C4:57.05%",
        "feature_division": {
            "ranks": [
                [
                    "F21",
                    0
                ],
                [
                    "F36",
                    1
                ],
                [
                    "F11",
                    2
                ],
                [
                    "F29",
                    3
                ],
                [
                    "F17",
                    4
                ],
                [
                    "F28",
                    5
                ],
                [
                    "F37",
                    6
                ],
                [
                    "F40",
                    7
                ],
                [
                    "F19",
                    8
                ],
                [
                    "F23",
                    9
                ],
                [
                    "F18",
                    10
                ],
                [
                    "F12",
                    11
                ],
                [
                    "F1",
                    12
                ],
                [
                    "F2",
                    13
                ],
                [
                    "F8",
                    14
                ],
                [
                    "F33",
                    15
                ],
                [
                    "F35",
                    16
                ],
                [
                    "F43",
                    17
                ],
                [
                    "F42",
                    18
                ],
                [
                    "F4",
                    19
                ],
                [
                    "F15",
                    20
                ],
                [
                    "F9",
                    21
                ],
                [
                    "F26",
                    22
                ],
                [
                    "F5",
                    23
                ],
                [
                    "F34",
                    24
                ],
                [
                    "F24",
                    25
                ],
                [
                    "F14",
                    26
                ],
                [
                    "F30",
                    27
                ],
                [
                    "F20",
                    28
                ],
                [
                    "F16",
                    29
                ],
                [
                    "F7",
                    30
                ],
                [
                    "F3",
                    31
                ],
                [
                    "F39",
                    32
                ],
                [
                    "F25",
                    33
                ],
                [
                    "F22",
                    34
                ],
                [
                    "F10",
                    35
                ],
                [
                    "F6",
                    36
                ],
                [
                    "F13",
                    37
                ],
                [
                    "F38",
                    38
                ],
                [
                    "F32",
                    39
                ],
                [
                    "F31",
                    40
                ],
                [
                    "F27",
                    41
                ],
                [
                    "F41",
                    42
                ]
            ],
            "contradict": [
                "F21",
                "F29",
                "F17",
                "F28",
                "F37",
                "F19",
                "F12",
                "F2",
                "F8",
                "F35",
                "F43",
                "F4",
                "F15",
                "F9",
                "F5",
                "F14",
                "F20",
                "F16",
                "F3",
                "F39",
                "F10",
                "F6"
            ],
            "support": [
                "F36",
                "F11",
                "F40",
                "F23",
                "F18",
                "F1",
                "F33",
                "F42",
                "F26",
                "F34",
                "F24",
                "F30",
                "F7",
                "F25",
                "F22"
            ],
            "ignore": [
                "F13",
                "F38",
                "F32",
                "F31",
                "F27",
                "F41"
            ]
        },
        "narration": "The prediction algorithm labelled the case as C4 based on the fact that it had the highest predicted probability among the possible class labels. To be specific, the predicted probabilities across the classes C2, C3, C1, and C4, respectively, are 4.14%, 12.80%, 26.01%, and 57.05%. Examining the attributions of the input features revealed that F21, F36, F11, F29, F17, F28, F37, F40, F19, F23, F18, and F12 are the major contributors to the algorithm's final predictive decision for the case under consideration. Among these influential features, F21, F29, F17, F28, F37, F19, and F12 are the negative features that shift the decision towards one of the alternative labels, possibly towards either C1 or C3. Contrarily, F36, F11, F40, F23, F18, and F1 are the positive features that mainly push the classification higher towards the label C4 while encouraging the algorithm to disregard the other labels."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:0.75%, C2:12.8%, C3:8.4%, C4:78.04%",
        "feature_division": {
            "ranks": [
                [
                    "F6",
                    0
                ],
                [
                    "F10",
                    1
                ],
                [
                    "F2",
                    2
                ],
                [
                    "F3",
                    3
                ],
                [
                    "F7",
                    4
                ],
                [
                    "F14",
                    5
                ],
                [
                    "F12",
                    6
                ],
                [
                    "F8",
                    7
                ],
                [
                    "F1",
                    8
                ],
                [
                    "F11",
                    9
                ],
                [
                    "F17",
                    10
                ],
                [
                    "F15",
                    11
                ],
                [
                    "F5",
                    12
                ],
                [
                    "F13",
                    13
                ],
                [
                    "F9",
                    14
                ],
                [
                    "F16",
                    15
                ],
                [
                    "F4",
                    16
                ]
            ],
            "contradict": [
                
                "F3",
                "F7",
                "F14",
                "F1",
                "F11",
                "F15",
                "F17",
                "F5",
                "F4"
            ],
            "support": [
                "F6",
                "F10",
                "F2",
                "F12",
                "F8",
                "F16",
                "F13",
                "F9"
            ],
            "ignore": [
                
            ]
        },
        "narration": "The predicted chance of any of the classes C3, C2, and C1 being the right label for the case given here is 8.4%, 12.8%, and 0.75%, respectively. As a consequence, C4 is the most plausible classification in this instance and to make this prediction decision, the values of all the features or variables were taken into account. From the feature attributions examination conducted, F6, F10, F2, F3, and F7 are the features with the most influence on the decision. Furthermore, the moderately influential features are F14, F12, F8, F1, and F11. Finally, F17, F15, F5, F13, F9, F16, and F4 are the remaining features ordered based on their impact level on the classification. Among the features, F6, F10, F2, F12, F8, F16, F13, and F9 are shown to be the positive features that push the prediction verdict in favour of the C4 label and away from the alternative labels. Reducing the likelihood of the C4 label and advocating for the selection of a different label are the negative labels F3, F7, F14, F1, F11, F15, F17, F5, and F4."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C4:58.00%, C2:14.05%, C3:15.11%, C1:12.84",
        "feature_division": {
            "ranks": [
                [
                    "F2",
                    0
                ],
                [
                    "F19",
                    1
                ],
                [
                    "F25",
                    2
                ],
                [
                    "F38",
                    3
                ],
                [
                    "F10",
                    4
                ],
                [
                    "F3",
                    5
                ],
                [
                    "F17",
                    6
                ],
                [
                    "F8",
                    7
                ],
                [
                    "F34",
                    8
                ],
                [
                    "F15",
                    9
                ],
                [
                    "F21",
                    10
                ],
                [
                    "F41",
                    11
                ],
                [
                    "F42",
                    12
                ],
                [
                    "F26",
                    13
                ],
                [
                    "F32",
                    14
                ],
                [
                    "F7",
                    15
                ],
                [
                    "F27",
                    16
                ],
                [
                    "F28",
                    17
                ],
                [
                    "F29",
                    18
                ],
                [
                    "F20",
                    19
                ],
                [
                    "F4",
                    20
                ],
                [
                    "F14",
                    21
                ],
                [
                    "F22",
                    22
                ],
                [
                    "F13",
                    23
                ],
                [
                    "F23",
                    24
                ],
                [
                    "F36",
                    25
                ],
                [
                    "F9",
                    26
                ],
                [
                    "F37",
                    27
                ],
                [
                    "F5",
                    28
                ],
                [
                    "F12",
                    29
                ],
                [
                    "F35",
                    30
                ],
                [
                    "F33",
                    31
                ],
                [
                    "F31",
                    32
                ],
                [
                    "F39",
                    33
                ],
                [
                    "F6",
                    34
                ],
                [
                    "F24",
                    35
                ],
                [
                    "F11",
                    36
                ],
                [
                    "F16",
                    37
                ],
                [
                    "F40",
                    38
                ],
                [
                    "F43",
                    39
                ],
                [
                    "F30",
                    40
                ],
                [
                    "F18",
                    41
                ],
                [
                    "F1",
                    42
                ]
            ],
            "contradict": [
                "F19",
                "F38",
                "F3",
                "F34",
                "F21",
                "F41",
                "F26",
                "F32",
                "F7",
                "F20",
                "F4",
                "F22",
                "F13",
                "F36",
                "F9",
                "F5",
                "F35",
                "F33",
                "F31"
            ],
            "support": [
                "F2",
                "F25",
                "F10",
                "F17",
                "F8",
                "F15",
                "F42",
                "F27",
                "F28",
                "F29",
                "F14",
                "F23",
                "F37",
                "F12",
                "F39",
                "F6",
                "F24",
                "F11"
            ],
            "ignore": [
                "F16",
                "F40",
                "F43",
                "F30",
                "F18",
                "F1"
            ]
        },
        "narration": "The predicted label is C4 since its predicted probabilit of 58.0% is higher than average. Specifically, the prediction probabilities of the other labels C2, C1, and C3, respectively, are 14.05%, 12.84%, and 15.11%. The major players resulting in this classification output decision are the variables F2, F19, F25, F38, F10, F3, F17, F8, F34, F15, F41, and F21. Among these top variables, F19, F38, F3, F34, F21, and F41 are the ones contributing negatively to the prediction decision. In other words, they are part of the variables pushing the verdict towards one of the other labels and away from C4. Those that enforce the predictive decision to head towards C4 are the variables F2, F25, F10, F17, F8, F15, and F42. Besides, given that F2 and F25 are positives and have the highest influence, it is not surprising that the model is sure that neither of the remaining labels is the right one."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:2.21%, C3:3.67%, C2:17.35%, C4:76.77%",
        "feature_division": {
            "rank": [
                [
                    "F45",
                    0
                ],
                [
                    "F1",
                    1
                ],
                [
                    "F13",
                    2
                ],
                [
                    "F23",
                    3
                ],
                [
                    "F41",
                    4
                ],
                [
                    "F20",
                    5
                ],
                [
                    "F19",
                    6
                ],
                [
                    "F32",
                    7
                ],
                [
                    "F30",
                    8
                ],
                [
                    "F28",
                    9
                ],
                [
                    "F16",
                    10
                ],
                [
                    "F21",
                    11
                ],
                [
                    "F43",
                    12
                ],
                [
                    "F17",
                    13
                ],
                [
                    "F12",
                    14
                ],
                [
                    "F18",
                    15
                ],
                [
                    "F8",
                    16
                ],
                [
                    "F15",
                    17
                ],
                [
                    "F34",
                    18
                ],
                [
                    "F35",
                    19
                ],
                [
                    "F11",
                    20
                ],
                [
                    "F46",
                    21
                ],
                [
                    "F25",
                    22
                ],
                [
                    "F6",
                    23
                ],
                [
                    "F47",
                    24
                ],
                [
                    "F22",
                    25
                ],
                [
                    "F40",
                    26
                ],
                [
                    "F33",
                    27
                ],
                [
                    "F26",
                    28
                ],
                [
                    "F37",
                    29
                ],
                [
                    "F4",
                    30
                ],
                [
                    "F10",
                    31
                ],
                [
                    "F39",
                    32
                ],
                [
                    "F44",
                    33
                ],
                [
                    "F7",
                    34
                ],
                [
                    "F5",
                    35
                ],
                [
                    "F42",
                    36
                ],
                [
                    "F14",
                    37
                ],
                [
                    "F2",
                    38
                ],
                [
                    "F36",
                    39
                ],
                [
                    "F29",
                    40
                ],
                [
                    "F27",
                    41
                ],
                [
                    "F38",
                    42
                ],
                [
                    "F9",
                    43
                ],
                [
                    "F24",
                    44
                ],
                [
                    "F48",
                    45
                ],
                [
                    "F3",
                    46
                ],
                [
                    "F31",
                    47
                ]
            ],
            "contradict": [
                
                "F13",
                "F41",
                "F28",
                "F16",
                "F8",
                "F35",
                "F11",
                "F46",
                "F6",
                "F47",
                "F22",
                "F40",
                "F10",
                "F39",
                "F7",
                "F14",
                "F2",
                "F27",
                "F38"
            ],
            "support": [
                "F45",
                "F1",
                "F23",
                "F20",
                "F19",
                "F32",
                "F30",
                "F21",
                "F43",
                "F17",
                "F12",
                "F18",
                "F15",
                "F34",
                "F25",
                "F33",
                "F26",
                "F37",
                "F4",
                "F44",
                "F5",
                "F42",
                "F36",
                "F29"
            ],
            "ignore": [
                
                "F9",
                "F24",
                "F48",
                "F3",
                "F31"
            ]
        },
        "narration": "C4 is the assigned class label by the model with a fairly high classification confidence of 76.77%. Furthermore, the predicted likelihoods of the alternative classes C3, C1, and C2 are 3.67%, 2.21%, and 17.35%, respectively, which implies that the model is certain that the likelihood of any of these labels is much smaller than that of C4. Examining the input variables indicates that the variables playing significant roles in this classification decision are F45, F1, F13, F23, and F41. The other variables with moderate contributions are F20, F19, F32, F30, and F28. Finally, the examination concluded that the remaining features, such as F17, F12, F18, F8, and F15, have lower contributions to the decision. With respect to the direction of influence of all the variables mentioned above, F13, F41, F28, F16, and F8 are the ones with negative attributions, resulting in a decrease in the likelihood of the C4 label. Specifically, the negative variables support labelling the case as either of the other possible labels, possibly C2. Contradicting the influence of the negative variables are the positive ones such as F45, F1, F23, and F20 that push the classification higher towards outputting the C4 label. In other words, the positive variables encourage the model to label the case as C4 instead of the other possible labels."
    },

    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:20.57%, C2:9.77%, C3:0.55%, C4:69.11%",
        "feature_division": {
            "rank": [
                [
                    "F8",
                    0
                ],
                [
                    "F16",
                    1
                ],
                [
                    "F10",
                    2
                ],
                [
                    "F6",
                    3
                ],
                [
                    "F7",
                    4
                ],
                [
                    "F5",
                    5
                ],
                [
                    "F15",
                    6
                ],
                [
                    "F11",
                    7
                ],
                [
                    "F13",
                    8
                ],
                [
                    "F22",
                    9
                ],
                [
                    "F29",
                    10
                ],
                [
                    "F14",
                    11
                ],
                [
                    "F4",
                    12
                ],
                [
                    "F19",
                    13
                ],
                [
                    "F17",
                    14
                ],
                [
                    "F26",
                    15
                ],
                [
                    "F3",
                    16
                ],
                [
                    "F25",
                    17
                ],
                [
                    "F21",
                    18
                ],
                [
                    "F24",
                    19
                ],
                [
                    "F28",
                    20
                ],
                [
                    "F27",
                    21
                ],
                [
                    "F1",
                    22
                ],
                [
                    "F12",
                    23
                ],
                [
                    "F23",
                    24
                ],
                [
                    "F18",
                    25
                ],
                [
                    "F2",
                    26
                ],
                [
                    "F20",
                    27
                ],
                [
                    "F9",
                    28
                ]
            ],
            "contradict": [
                "F8",
                
                "F15",
                "F13",
                "F22",
                "F29",
                "F14",
                "F19",
                "F25",
                "F21",
                "F28",
                "F1",
                "F23"
            ],
            "support": [
                "F16",
                "F10",
                "F6",
                "F7",
                "F5",
                "F11",
                "F4",
                "F17",
                "F26",
                "F3",
                "F24",
                "F27",
                "F12",
                "F18"
            ],
            "ignore": [
                "F2",
                "F20",
                "F9"
            ]
        },
        "narration": "The predicted probabilities of the labels C2, C1, and C3 are 9.77%, 20.57%, and 0.55%, respectively. It can be concluded that, given the likelihood of C3 and C2, the model is certain that none of them is the true label. Furthermore, the likelihood of C1 is far less than that of C4. Therefore, the classification output decision is that C4 is the most likely label, with a predicted probability of 69.11%. Motivating this classification decision are the variables such as F8, F16, F10, F6, F7, F5, and F15. Investigating the contributions of the input variables with respect to this classification showed that F8, F15, F13, F22, F29, and F14 are the top negatives, causing the uncertainty in the prediction. These negatives support assigning a different label to the case given while on the other side of the coin, the prediction is supported by the values of the top positive variables, F16, F10, F6, F7, F5, F11, F4, and F17. The positive variables are responsible for the model's being certain that the true label is likely C4."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:6.64%, C2:0.47%, C3:0.51%, C4:92.37%",
        "feature_division": {
            "rank": [
                [
                    "F23",
                    0
                ],
                [
                    "F44",
                    1
                ],
                [
                    "F3",
                    2
                ],
                [
                    "F39",
                    3
                ],
                [
                    "F27",
                    4
                ],
                [
                    "F45",
                    5
                ],
                [
                    "F13",
                    6
                ],
                [
                    "F21",
                    7
                ],
                [
                    "F16",
                    8
                ],
                [
                    "F4",
                    9
                ],
                [
                    "F37",
                    10
                ],
                [
                    "F36",
                    11
                ],
                [
                    "F8",
                    12
                ],
                [
                    "F46",
                    13
                ],
                [
                    "F10",
                    14
                ],
                [
                    "F12",
                    15
                ],
                [
                    "F35",
                    16
                ],
                [
                    "F1",
                    17
                ],
                [
                    "F43",
                    18
                ],
                [
                    "F26",
                    19
                ],
                [
                    "F38",
                    20
                ],
                [
                    "F22",
                    21
                ],
                [
                    "F30",
                    22
                ],
                [
                    "F51",
                    23
                ],
                [
                    "F29",
                    24
                ],
                [
                    "F49",
                    25
                ],
                [
                    "F32",
                    26
                ],
                [
                    "F7",
                    27
                ],
                [
                    "F52",
                    28
                ],
                [
                    "F28",
                    29
                ],
                [
                    "F41",
                    30
                ],
                [
                    "F48",
                    31
                ],
                [
                    "F50",
                    32
                ],
                [
                    "F5",
                    33
                ],
                [
                    "F18",
                    34
                ],
                [
                    "F34",
                    35
                ],
                [
                    "F40",
                    36
                ],
                [
                    "F42",
                    37
                ],
                [
                    "F9",
                    38
                ],
                [
                    "F19",
                    39
                ],
                [
                    "F24",
                    40
                ],
                [
                    "F20",
                    41
                ],
                [
                    "F15",
                    42
                ],
                [
                    "F17",
                    43
                ],
                [
                    "F47",
                    44
                ],
                [
                    "F31",
                    45
                ],
                [
                    "F11",
                    46
                ],
                [
                    "F6",
                    47
                ],
                [
                    "F33",
                    48
                ],
                [
                    "F14",
                    49
                ],
                [
                    "F25",
                    50
                ],
                [
                    "F2",
                    51
                ]
            ],
            "contradict": [
                
                "F3",
                "F27",
                "F16",
                "F4",
                "F37",
                "F8",
                "F46",
                "F10",
                "F12",
                "F43",
                "F32",
                "F28",
                "F48",
                "F50",
                "F18"
            ],
            "support": [
                "F23",
                "F44",
                "F39",
                "F45",
                "F13",
                "F21",
                "F36",
                "F35",
                "F1",
                "F26",
                "F38",
                "F22",
                "F30",
                "F51",
                "F29",
                "F49",
                "F7",
                "F52",
                "F41",
                "F5",
                "F34"
            ],
            "ignore": [
                "F40",
                "F42",
                "F9",
                "F19",
                "F24",
                "F20",
                "F15",
                "F17",
                "F47",
                "F31",
                "F11",
                "F6",
                "F33",
                "F14",
                "F25",
                "F2"
            ]
        },
        "narration": "For this classification instance, the assigned class label is C4 with a very high predicted likelihood equal to 92.37%. This C4 predicted probability is far greater than the other possible labels, hence we can conclude that the model is very certain that neither C1 nor C2 nor C3 is the true label. The features shown to play a major role in the class assignment decision above are F23, F44, F3, F39, F27, F45, and F13. Some of the other notable contributing features are F21, F16, F4, F37, F36, and F8. Among all the features mentioned here, F3, F27, F16, F4, F37, and F8 are the ones shown to have negative contributions, meaning they support assigning one of the other possible labels. Contradicting the negative influence is the very high joint positive contributions of F23, F44, F39, F45, F13, and F21. Taking into account or consideration the contributions of the positive features, the model is highly motivated to label the case as C4 and they are the ones that push the decision away from the other labels."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:6.64%, C2:0.47%, C3:0.51%, C4:92.37%",
        "feature_division": {
            "rank": [
                [
                    "F23",
                    0
                ],
                [
                    "F44",
                    1
                ],
                [
                    "F3",
                    2
                ],
                [
                    "F39",
                    3
                ],
                [
                    "F27",
                    4
                ],
                [
                    "F45",
                    5
                ],
                [
                    "F13",
                    6
                ],
                [
                    "F21",
                    7
                ],
                [
                    "F16",
                    8
                ],
                [
                    "F4",
                    9
                ],
                [
                    "F37",
                    10
                ],
                [
                    "F36",
                    11
                ],
                [
                    "F8",
                    12
                ],
                [
                    "F46",
                    13
                ],
                [
                    "F10",
                    14
                ],
                [
                    "F12",
                    15
                ],
                [
                    "F35",
                    16
                ],
                [
                    "F1",
                    17
                ],
                [
                    "F43",
                    18
                ],
                [
                    "F26",
                    19
                ],
                [
                    "F38",
                    20
                ],
                [
                    "F22",
                    21
                ],
                [
                    "F30",
                    22
                ],
                [
                    "F51",
                    23
                ],
                [
                    "F29",
                    24
                ],
                [
                    "F49",
                    25
                ],
                [
                    "F32",
                    26
                ],
                [
                    "F7",
                    27
                ],
                [
                    "F52",
                    28
                ],
                [
                    "F28",
                    29
                ],
                [
                    "F41",
                    30
                ],
                [
                    "F48",
                    31
                ],
                [
                    "F50",
                    32
                ],
                [
                    "F5",
                    33
                ],
                [
                    "F18",
                    34
                ],
                [
                    "F34",
                    35
                ],
                [
                    "F40",
                    36
                ],
                [
                    "F42",
                    37
                ],
                [
                    "F9",
                    38
                ],
                [
                    "F19",
                    39
                ],
                [
                    "F24",
                    40
                ],
                [
                    "F20",
                    41
                ],
                [
                    "F15",
                    42
                ],
                [
                    "F17",
                    43
                ],
                [
                    "F47",
                    44
                ],
                [
                    "F31",
                    45
                ],
                [
                    "F11",
                    46
                ],
                [
                    "F6",
                    47
                ],
                [
                    "F33",
                    48
                ],
                [
                    "F14",
                    49
                ],
                [
                    "F25",
                    50
                ],
                [
                    "F2",
                    51
                ]
            ],
            "contradict": [
                
                "F3",
                "F27",
                "F16",
                "F4",
                "F37",
                "F8",
                "F46",
                "F10",
                "F12",
                "F43",
                "F32",
                "F28",
                "F48",
                "F50",
                "F18"
            ],
            "support": [
                "F23",
                "F44",
                "F39",
                "F45",
                "F13",
                "F21",
                "F36",
                "F35",
                "F1",
                "F26",
                "F38",
                "F22",
                "F30",
                "F51",
                "F29",
                "F49",
                "F7",
                "F52",
                "F41",
                "F5",
                "F34"
            ],
            "ignore": [
                "F40",
                "F42",
                "F9",
                "F19",
                "F24",
                "F20",
                "F15",
                "F17",
                "F47",
                "F31",
                "F11",
                "F6",
                "F33",
                "F14",
                "F25",
                "F2"
            ]
        },
        "narration": "The suggested class label for this classification instance is C4, with a very high predicted probability of 92.37%. Because the predicted probability for C4 is significantly bigger than the estimated probabilities for the other three labels, we can conclude that the model is extremely positive that neither C1 nor C2 nor C3 is the true label. F23, F39, F27, F44, F13, F45, and F3 are the variables demonstrated to have a significant impact on the class assignment choice above. F21, F16, F4, F37, F36, and F8 are some of the other major contributing variables. Among all the variables described above, F3, F27, F16, F4, F37, and F8 have negative contributions, indicating that they favour selecting one of the other alternative labels. The very large combined positive contributions of F23, F44, F39, F45, F13, and F21 contradict the negative influence. In closing, the model's decision to classify the instance as C4 is motivated by the positive variables, and these are the ones that drive the conclusion away from the other labels."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:0.0%, C2:0.0%, C3:0.0%, C4:100.0%",
        "feature_division": {
            "rank": [
                [
                    "F17",
                    0
                ],
                [
                    "F44",
                    1
                ],
                [
                    "F14",
                    2
                ],
                [
                    "F37",
                    3
                ],
                [
                    "F41",
                    4
                ],
                [
                    "F20",
                    5
                ],
                [
                    "F22",
                    6
                ],
                [
                    "F45",
                    7
                ],
                [
                    "F6",
                    8
                ],
                [
                    "F19",
                    9
                ],
                [
                    "F28",
                    10
                ],
                [
                    "F15",
                    11
                ],
                [
                    "F30",
                    12
                ],
                [
                    "F25",
                    13
                ],
                [
                    "F31",
                    14
                ],
                [
                    "F11",
                    15
                ],
                [
                    "F39",
                    16
                ],
                [
                    "F2",
                    17
                ],
                [
                    "F29",
                    18
                ],
                [
                    "F12",
                    19
                ],
                [
                    "F16",
                    20
                ],
                [
                    "F18",
                    21
                ],
                [
                    "F4",
                    22
                ],
                [
                    "F13",
                    23
                ],
                [
                    "F33",
                    24
                ],
                [
                    "F24",
                    25
                ],
                [
                    "F3",
                    26
                ],
                [
                    "F46",
                    27
                ],
                [
                    "F32",
                    28
                ],
                [
                    "F27",
                    29
                ],
                [
                    "F48",
                    30
                ],
                [
                    "F40",
                    31
                ],
                [
                    "F21",
                    32
                ],
                [
                    "F7",
                    33
                ],
                [
                    "F38",
                    34
                ],
                [
                    "F35",
                    35
                ],
                [
                    "F5",
                    36
                ],
                [
                    "F23",
                    37
                ],
                [
                    "F26",
                    38
                ],
                [
                    "F42",
                    39
                ],
                [
                    "F9",
                    40
                ],
                [
                    "F34",
                    41
                ],
                [
                    "F8",
                    42
                ],
                [
                    "F1",
                    43
                ],
                [
                    "F43",
                    44
                ],
                [
                    "F47",
                    45
                ],
                [
                    "F36",
                    46
                ],
                [
                    "F10",
                    47
                ]
            ],
            "contradict": [
                
                "F33",
                "F3",
                "F27",
                "F21",
                "F7",
                "F14",
                "F37",
                "F41",
                "F20",
                "F22",
                "F45",
                "F6"
            ],
            "support": [
                "F44",
                "F28",
                "F25",
                "F11",
                "F29",
                "F13",
                "F24",
                "F46",
                "F32",
                "F48",
                "F40",
                "F17",
                
                "F19",
                "F15",
                "F30",
                "F31",
                "F39",
                "F2",
                "F12",
                "F16",
                "F18",
                "F4"
            ],
            "ignore": [
                "F38",
                "F35",
                "F5",
                "F23",
                "F26",
                "F42",
                "F9",
                "F34",
                "F8",
                "F1",
                "F43",
                "F47",
                "F36",
                "F10"
            ]
        },
        "narration": "The output predicted label for the case under consideration is C4, with a very high classification confidence level and mainly because the predicted likelihoods of the other classes, C1, C3, and C2, are all very low. The certainty of the model can be traced to the influence of the information supplied about the case. Specifically, regarding this case under consideration, the model's decision concerning the right label choice is primarily affected by the values of F17, F44, F14, F37, F41, F20, and F22. And among these features, F37, F22, F20, and F41 are the top negative features that attempt to drive the classification towards one of the other labels. However, considering the certainty of the classification decision here, it can be concluded that the influence of these aforementioned negative features together with other negatives such as F33, F3, and F27 is very small when compared to that of the top positive features, F17, F44, F14, and F19. Some of the other features with positive attributions are F28, F25, and F11."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:5.5%, C3:12.91%, C2:0.31%, C4:81.28%",
        "feature_division": {
            "rank": [
                [
                    "F27",
                    0
                ],
                [
                    "F8",
                    1
                ],
                [
                    "F35",
                    2
                ],
                [
                    "F20",
                    3
                ],
                [
                    "F4",
                    4
                ],
                [
                    "F29",
                    5
                ],
                [
                    "F24",
                    6
                ],
                [
                    "F48",
                    7
                ],
                [
                    "F49",
                    8
                ],
                [
                    "F46",
                    9
                ],
                [
                    "F34",
                    10
                ],
                [
                    "F39",
                    11
                ],
                [
                    "F33",
                    12
                ],
                [
                    "F43",
                    13
                ],
                [
                    "F13",
                    14
                ],
                [
                    "F17",
                    15
                ],
                [
                    "F19",
                    16
                ],
                [
                    "F9",
                    17
                ],
                [
                    "F38",
                    18
                ],
                [
                    "F40",
                    19
                ],
                [
                    "F7",
                    20
                ],
                [
                    "F1",
                    21
                ],
                [
                    "F32",
                    22
                ],
                [
                    "F21",
                    23
                ],
                [
                    "F42",
                    24
                ],
                [
                    "F41",
                    25
                ],
                [
                    "F14",
                    26
                ],
                [
                    "F47",
                    27
                ],
                [
                    "F3",
                    28
                ],
                [
                    "F44",
                    29
                ],
                [
                    "F52",
                    30
                ],
                [
                    "F25",
                    31
                ],
                [
                    "F36",
                    32
                ],
                [
                    "F18",
                    33
                ],
                [
                    "F23",
                    34
                ],
                [
                    "F28",
                    35
                ],
                [
                    "F26",
                    36
                ],
                [
                    "F15",
                    37
                ],
                [
                    "F22",
                    38
                ],
                [
                    "F5",
                    39
                ],
                [
                    "F10",
                    40
                ],
                [
                    "F12",
                    41
                ],
                [
                    "F16",
                    42
                ],
                [
                    "F31",
                    43
                ],
                [
                    "F45",
                    44
                ],
                [
                    "F37",
                    45
                ],
                [
                    "F51",
                    46
                ],
                [
                    "F2",
                    47
                ],
                [
                    "F11",
                    48
                ],
                [
                    "F50",
                    49
                ],
                [
                    "F30",
                    50
                ],
                [
                    "F6",
                    51
                ]
            ],
            "contradict": [
                "F8",
                "F35",
                "F20",
                
                
                "F49",
                "F34",
                "F39",
                "F43",
                "F17",
                "F9",
                "F40",
                "F7",
                "F41",
                "F14",
                "F47",
                "F44",
                "F52",
                "F25",
                "F36",
                "F22",
                "F16",
                "F31",
                "F45",
                "F37",
                "F51"
            ],
            "support": [
                "F27",
                
                "F4",
                "F29",
                "F24",
                "F48",
                "F46",
                "F33",
                "F13",
                "F19",
                "F38",
                "F1",
                "F32",
                "F21",
                "F42",
                "F3",
                "F18",
                "F23",
                "F28",
                "F26",
                "F15",
                "F5",
                "F10",
                "F12"
            ],
            "ignore": [
                "F2",
                "F11",
                "F50",
                "F30",
                "F6"
            ]
        },
        "narration": "Neither the label C2 nor C3 nor C1 is predicted as the true label for the given case. With a confidence level of 81.28%, the algorithm outputs C4 as the most probable label choice. The influence of the various input variables analysed is responsible for the degree of certainty in the above prediction. Per the attribution examination, the most influential variables are F27, F8, F35, F20, F4, F24, and F29. Among the above-stated variables, F27, F4, F24, and F29 are the ones with positive attributions that drive the decision higher towards C4. Moderately influential positive variables are F46, F33, and F13. Given that the predicted confidence in the label choice is 81.28%, it can be concluded that the variables such as F8, F35, F20, F34, F39, and F49 with their negative attributions are responsible for the predicted likelihood across the alternative labels. In other words, the negative variables do not support labelling the case as C4, however, comparing the attributions of F8 and F35 to that of F27 explains why the model is highly certain that C4 is the most probable label."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:2.93%, C2:3.47%, C3:13.4%, C4:70.19%",
        "feature_division": {
            "rank": [
                [
                    "F22",
                    0
                ],
                [
                    "F18",
                    1
                ],
                [
                    "F32",
                    2
                ],
                [
                    "F7",
                    3
                ],
                [
                    "F24",
                    4
                ],
                [
                    "F34",
                    5
                ],
                [
                    "F21",
                    6
                ],
                [
                    "F3",
                    7
                ],
                [
                    "F5",
                    8
                ],
                [
                    "F33",
                    9
                ],
                [
                    "F38",
                    10
                ],
                [
                    "F4",
                    11
                ],
                [
                    "F46",
                    12
                ],
                [
                    "F8",
                    13
                ],
                [
                    "F9",
                    14
                ],
                [
                    "F44",
                    15
                ],
                [
                    "F35",
                    16
                ],
                [
                    "F30",
                    17
                ],
                [
                    "F16",
                    18
                ],
                [
                    "F17",
                    19
                ],
                [
                    "F43",
                    20
                ],
                [
                    "F19",
                    21
                ],
                [
                    "F25",
                    22
                ],
                [
                    "F37",
                    23
                ],
                [
                    "F2",
                    24
                ],
                [
                    "F36",
                    25
                ],
                [
                    "F39",
                    26
                ],
                [
                    "F20",
                    27
                ],
                [
                    "F12",
                    28
                ],
                [
                    "F11",
                    29
                ],
                [
                    "F23",
                    30
                ],
                [
                    "F28",
                    31
                ],
                [
                    "F14",
                    32
                ],
                [
                    "F10",
                    33
                ],
                [
                    "F1",
                    34
                ],
                [
                    "F15",
                    35
                ],
                [
                    "F29",
                    36
                ],
                [
                    "F26",
                    37
                ],
                [
                    "F48",
                    38
                ],
                [
                    "F27",
                    39
                ],
                [
                    "F47",
                    40
                ],
                [
                    "F40",
                    41
                ],
                [
                    "F13",
                    42
                ],
                [
                    "F45",
                    43
                ],
                [
                    "F6",
                    44
                ],
                [
                    "F31",
                    45
                ],
                [
                    "F41",
                    46
                ],
                [
                    "F42",
                    47
                ]
            ],
            "contradict": [
                "F22",
                "F24",
                "F38",
                "F4",
                "F46",
                "F30",
                "F16",
                "F43",
                "F19",
                "F25",
                "F36",
                "F39",
                "F23",
                "F14",
                "F15",
                "F13",
                "F45",
                "F6",
                "F31"
            ],
            "support": [
                "F18",
                "F32",
                "F7",
                "F34",
                "F21",
                "F3",
                "F5",
                "F33",
                "F8",
                "F9",
                "F44",
                "F35",
                "F17",
                "F37",
                "F2",
                "F20",
                "F12",
                "F11",
                "F28",
                "F10",
                "F1",
                "F29",
                "F26",
                "F48",
                "F27",
                "F47",
                "F40"
            ],
            "ignore": [
                
                "F41",
                "F42"
            ]
        },
        "narration": "Regarding the case given, the algorithm's confidence in the assigned label, C4, is 70.19%, which is higher than any of the other possible labels. The next probable class label is identified as C3, with a predicted likelihood of 13.43%. Finally, the likelihoods of C2 and C1 were 3.47% and 2.93%, respectively. Examining the attributions of the input variables indicates that F18, F22, F32, F7, F24, and F34 have the most influence on the classification output decision or verdict with respect to the given case. In addition, the values of F21, F3, F5, F33, F4, F46, and F38 are shown to moderately contribute to the decision made here. Among all the influential variables mentioned above, only F22, F24, F38, F4, and F46 are identified as negatives, suggesting that their contributions are responsible for the predicted likelihoods across the less probable labels C2, C1, and C3. In other words, the negative contributions of these variables support labelling the case as either C1 or C2 or C3. Contrary to their negative influence, the values of F18, F32, F7, F34, F21, and F3 strongly motivate the classification decision to head towards C4 and away from the other labels. The negative and positive contributions of the variables explain why the certainty in the decision is only 70.19%."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:0.49%, C2:15.14%, C3:0.86%, C4:83.51%",
        "feature_division": {
            "rank": [
                [
                    "F6",
                    0
                ],
                [
                    "F16",
                    1
                ],
                [
                    "F20",
                    2
                ],
                [
                    "F3",
                    3
                ],
                [
                    "F9",
                    4
                ],
                [
                    "F21",
                    5
                ],
                [
                    "F17",
                    6
                ],
                [
                    "F19",
                    7
                ],
                [
                    "F18",
                    8
                ],
                [
                    "F24",
                    9
                ],
                [
                    "F25",
                    10
                ],
                [
                    "F4",
                    11
                ],
                [
                    "F8",
                    12
                ],
                [
                    "F22",
                    13
                ],
                [
                    "F28",
                    14
                ],
                [
                    "F29",
                    15
                ],
                [
                    "F15",
                    16
                ],
                [
                    "F14",
                    17
                ],
                [
                    "F2",
                    18
                ],
                [
                    "F7",
                    19
                ],
                [
                    "F11",
                    20
                ],
                [
                    "F12",
                    21
                ],
                [
                    "F10",
                    22
                ],
                [
                    "F1",
                    23
                ],
                [
                    "F26",
                    24
                ],
                [
                    "F5",
                    25
                ],
                [
                    "F23",
                    26
                ],
                [
                    "F13",
                    27
                ],
                [
                    "F27",
                    28
                ]
            ],
            "contradict": [
                "F20",
                "F3",
                "F9",
                "F21",
                "F17",
                "F18",
                "F4",
                "F14",
                "F2",
                "F7"
            ],
            "support": [
                "F6",
                "F16",
                "F19",
                "F24",
                "F25",
                "F8",
                "F22",
                "F28",
                "F29",
                "F15",
                "F11",
                "F12",
                "F10",
                "F26"
            ],
            "ignore": [
                
                "F1",
                
                "F5",
                "F23",
                "F13",
                "F27"
            ]
        },
        "narration": "The predicted outcome of the model is C4 with a confidence level equal to 83.51%, and on the other hand, the predicted likelihoods of the other labels, C1, C2, and C3, respectively, are 0.49%, 15.14%, and 0.86%. Influencing the model's predicted outcome are mainly the variables F6, F20, F16, F3, F9, and F21. Those with moderate contributions are F19, F17, F18, F24, and F25. Examining further the attributions of all the above mentioned revealed that F6, F16, and F19 are the top positive variables, causing the model's decision to head towards label C4. Considering the predicted probabilities across the labels, the influence of top negative variables F20, F3, F9, F21, and F17 is responsible for the marginal doubt in the final decision since their values motivate labelling the case as one of the other possible labels."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:0.49%, C2:15.14%, C3:0.86%, C4:83.51%",
        "feature_division": {
            "rank": [
                [
                    "F6",
                    1
                ],
                [
                    "F16",
                    0
                ],
                [
                    "F20",
                    2
                ],
                [
                    "F3",
                    3
                ],
                [
                    "F9",
                    4
                ],
                [
                    "F21",
                    5
                ],
                [
                    "F17",
                    6
                ],
                [
                    "F19",
                    7
                ],
                [
                    "F18",
                    8
                ],
                [
                    "F24",
                    9
                ],
                [
                    "F25",
                    10
                ],
                [
                    "F4",
                    11
                ],
                [
                    "F8",
                    12
                ],
                [
                    "F22",
                    13
                ],
                [
                    "F28",
                    14
                ],
                [
                    "F29",
                    15
                ],
                [
                    "F15",
                    16
                ],
                [
                    "F14",
                    17
                ],
                [
                    "F2",
                    18
                ],
                [
                    "F7",
                    19
                ],
                [
                    "F11",
                    20
                ],
                [
                    "F12",
                    21
                ],
                [
                    "F10",
                    22
                ],
                [
                    "F1",
                    23
                ],
                [
                    "F26",
                    24
                ],
                [
                    "F5",
                    25
                ],
                [
                    "F23",
                    26
                ],
                [
                    "F13",
                    27
                ],
                [
                    "F27",
                    28
                ]
            ],
            "contradict": [
                "F20",
                "F3",
                "F9",
                "F21",
                "F17",
                "F18",
                "F4",
                "F14",
                "F2",
                "F7"
            ],
            "support": [
                "F6",
                "F16",
                "F19",
                "F24",
                "F25",
                "F8",
                "F22",
                "F28",
                "F29",
                "F15",
                "F11",
                "F12",
                "F10"
            ],
            "ignore": [
                
                "F1",
                "F26",
                "F5",
                "F23",
                "F13",
                "F27"
            ]
        },
        "narration": "The ML algorithm classifies the provided data or case as C4 with a likelihood of 83.51%, meaning that it is more likely to be the true label than the other possible labels. The algorithm's confidence in this classification is higher, mainly due to the positive and negative influences of the different variables. F6, F20, and F16 are the primary contributors to the above-mentioned classification output. The features that contribute positively to the classifier's decision are mainly F6, F16, and F19, and they are the features that shift the classification higher towards C4. On the flip side, negative features such as F20, F3, F21, and F9 reduce the likelihood of C4 being the true label, hence they support outputting one of the alternative labels."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:0.35%, C2:2.06%, C3:5.55%, C4:92.05%",
        "feature_division": {
            "rank": [
                [
                    "F1",
                    0
                ],
                [
                    "F31",
                    1
                ],
                [
                    "F29",
                    2
                ],
                [
                    "F12",
                    3
                ],
                [
                    "F14",
                    4
                ],
                [
                    "F24",
                    5
                ],
                [
                    "F4",
                    6
                ],
                [
                    "F7",
                    7
                ],
                [
                    "F16",
                    8
                ],
                [
                    "F20",
                    9
                ],
                [
                    "F5",
                    10
                ],
                [
                    "F30",
                    11
                ],
                [
                    "F25",
                    12
                ],
                [
                    "F27",
                    13
                ],
                [
                    "F15",
                    14
                ],
                [
                    "F26",
                    15
                ],
                [
                    "F22",
                    16
                ],
                [
                    "F19",
                    17
                ],
                [
                    "F6",
                    18
                ],
                [
                    "F21",
                    19
                ],
                [
                    "F8",
                    20
                ],
                [
                    "F23",
                    21
                ],
                [
                    "F13",
                    22
                ],
                [
                    "F28",
                    23
                ],
                [
                    "F9",
                    24
                ],
                [
                    "F32",
                    25
                ],
                [
                    "F3",
                    26
                ],
                [
                    "F17",
                    27
                ],
                [
                    "F18",
                    28
                ],
                [
                    "F11",
                    29
                ],
                [
                    "F10",
                    30
                ],
                [
                    "F2",
                    31
                ]
            ],
            "contradict": [
                "F1",
                "F7",
                "F16",
                "F5",
                "F27",
                "F15",
                "F6",
                "F21",
                "F23",
                "F13",
                "F9",
                "F3"
            ],
            "support": [
                "F31",
                "F29",
                "F12",
                "F14",
                "F24",
                "F4",
                "F20",
                "F30",
                "F25",
                "F26",
                "F22",
                "F19",
                "F8",
                "F28",
                "F32",
                "F17"
            ],
            "ignore": [
                "F18",
                "F11",
                "F10",
                "F2"
            ]
        },
        "narration": "The algorithm predicted label C4 with a very high confidence level of 92.05%, which implies that any other label, either C2, C1, or C3, is highly unlikely. F1, F31, F29, and F12 are by far the most influential, whereas F3, F32, and F17 are among the least influential. Regarding the direction of influence of the features, F31, F29, F12, F14, and F24 are the top positive features, shifting the classification decision higher towards C4. Conversely, the contributions of F1, F7, F16, F5, F27, and F15 indicate that the true label could likely be one of the other labels. The very high confidence level of 92.05% can be easily explained by considering the fact that the majority of top contributing features have positive contributions that strongly drive the decision away from the other labels and towards the C4 label. Finally, the attributions analysis indicates that the values of F18, F11, and F10 have insignificant contributions to the final decision."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:10.18%, C2:1.0%, C3:14.34%, C4:74.48%",
        "feature_division": {
            "rank": [
                [
                    "F23",
                    0
                ],
                [
                    "F1",
                    1
                ],
                [
                    "F3",
                    2
                ],
                [
                    "F16",
                    3
                ],
                [
                    "F20",
                    4
                ],
                [
                    "F21",
                    5
                ],
                [
                    "F32",
                    6
                ],
                [
                    "F4",
                    7
                ],
                [
                    "F8",
                    8
                ],
                [
                    "F6",
                    9
                ],
                [
                    "F12",
                    10
                ],
                [
                    "F28",
                    11
                ],
                [
                    "F17",
                    12
                ],
                [
                    "F2",
                    13
                ],
                [
                    "F19",
                    14
                ],
                [
                    "F5",
                    15
                ],
                [
                    "F30",
                    16
                ],
                [
                    "F15",
                    17
                ],
                [
                    "F13",
                    18
                ],
                [
                    "F25",
                    19
                ],
                [
                    "F18",
                    20
                ],
                [
                    "F27",
                    21
                ],
                [
                    "F29",
                    22
                ],
                [
                    "F11",
                    23
                ],
                [
                    "F9",
                    24
                ],
                [
                    "F31",
                    25
                ],
                [
                    "F14",
                    26
                ],
                [
                    "F24",
                    27
                ],
                [
                    "F10",
                    28
                ],
                [
                    "F7",
                    29
                ],
                [
                    "F22",
                    30
                ],
                [
                    "F26",
                    31
                ]
            ],
            "contradict": [
                
                "F21",
                "F4",
                "F8",
                "F6",
                "F28",
                "F5",
                "F13",
                "F25",
                "F29",
                "F11",
                "F9",
                "F31",
                "F14",
                "F24"
            ],
            "support": [
                "F23",
                "F1",
                "F3",
                "F16",
                "F20",
                "F32",
                "F12",
                "F17",
                "F2",
                "F19",
                "F30",
                "F15",
                "F18",
                "F27"
            ],
            "ignore": [
                
                "F10",
                "F7",
                "F22",
                "F26"
            ]
        },
        "narration": "The label for this case is predicted to be C4, with a probability of 74.48%. However, looking at the predicted probabilities across the other possible labels, it is clear why the classifier is quite certain that not all the labels are the right ones, and they are those with the least confidence. The top positive features that increase the classifier's response in favour of C4 are F23, F3, F1, and F16. Conversely, those with negative attributions that decrease the likelihood of C4 being the true label for the case under consideration are mainly F21, F4, F6, and F8, which are responsible for the apparent doubt in the classification output verdict. Given that several of the top influential features have positive attributions, it is not surprising that the output label of the classifier is C4 instead of another. Besides, F32, F12, F17, and F2 have moderate positive contributions, further shifting the decision towards C4. Finally, the classifier likely pays nearly no attention to the values of F10, F7, and F22 since their attributions, according to the analysis, are almost zero."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C3:1.96%, C2:11.38%, C1:26.5%, C4:60.15%",
        "feature_division": {
            "rank": [
                [
                    "F6",
                    0
                ],
                [
                    "F20",
                    1
                ],
                [
                    "F1",
                    2
                ],
                [
                    "F22",
                    3
                ],
                [
                    "F5",
                    4
                ],
                [
                    "F2",
                    5
                ],
                [
                    "F24",
                    6
                ],
                [
                    "F14",
                    7
                ],
                [
                    "F9",
                    8
                ],
                [
                    "F11",
                    9
                ],
                [
                    "F8",
                    10
                ],
                [
                    "F4",
                    11
                ],
                [
                    "F28",
                    12
                ],
                [
                    "F27",
                    13
                ],
                [
                    "F3",
                    14
                ],
                [
                    "F15",
                    15
                ],
                [
                    "F26",
                    16
                ],
                [
                    "F25",
                    17
                ],
                [
                    "F19",
                    18
                ],
                [
                    "F23",
                    19
                ],
                [
                    "F7",
                    20
                ],
                [
                    "F10",
                    21
                ],
                [
                    "F17",
                    22
                ],
                [
                    "F29",
                    23
                ],
                [
                    "F16",
                    24
                ],
                [
                    "F18",
                    25
                ],
                [
                    "F13",
                    26
                ],
                [
                    "F21",
                    27
                ],
                [
                    "F12",
                    28
                ]
            ],
            "contradict": [
                "F6",
                "F1",
                "F5",
                "F24",
                "F9",
                "F4",
                "F28",
                "F26",
                "F19",
                "F17",
                "F29"
            ],
            "support": [
                "F20",
                "F22",
                "F2",
                "F14",
                "F11",
                "F8",
                "F27",
                "F3",
                "F15",
                "F25",
                "F23",
                "F7",
                "F10",
                "F16",
                "F18"
            ],
            "ignore": [
                "F13",
                "F21",
                "F12"
            ]
        },
        "narration": "According to the classification algorithm employed, the most probable label for this case is C4, since its predicted probability is higher than the other labels, C3, C2, and C1. In addition, the next probable label is C1, with a likelihood of 26.5%, which is followed by C2 with 11.38% predictability, and lastly, C3 with only 1.96% likelihood. Examining the feature attributions showed that F6, F1, F20, F22, and F5 are the main contributors to the classification decision made for the case here. Furthermore, the analysis categorised the features into three main groups based on their respective directions of contribution. The positive features are mainly F20, F22, F2, F14, F11, and F8 with contributions increasing the likelihood of the assigned label. Driving the classification in a different direction are the negative features such as F6, F1, F5, F24, and F9, since their contributions decrease the odds of C4 being the true label. Finally, the irrelevant set of features, F13, F12, and F21, whose values are likely ignored by the classifier because their attribution scores are very close to zero, are the least ranked features. Given that the top features, F1 and F6, are all negative, it is not surprising that the algorithm is not 100.0% certain about the assigned label."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C1:14.39%, C2:11.74%, C3:63.15%, C4:10.73%",
        "feature_division": {
            "rank": [
                [
                    "F15",
                    0
                ],
                [
                    "F24",
                    1
                ],
                [
                    "F10",
                    2
                ],
                [
                    "F28",
                    3
                ],
                [
                    "F13",
                    4
                ],
                [
                    "F16",
                    5
                ],
                [
                    "F3",
                    6
                ],
                [
                    "F30",
                    7
                ],
                [
                    "F9",
                    8
                ],
                [
                    "F8",
                    9
                ],
                [
                    "F20",
                    10
                ],
                [
                    "F37",
                    11
                ],
                [
                    "F38",
                    12
                ],
                [
                    "F5",
                    13
                ],
                [
                    "F35",
                    14
                ],
                [
                    "F25",
                    15
                ],
                [
                    "F22",
                    16
                ],
                [
                    "F29",
                    17
                ],
                [
                    "F33",
                    18
                ],
                [
                    "F32",
                    19
                ],
                [
                    "F44",
                    20
                ],
                [
                    "F39",
                    21
                ],
                [
                    "F1",
                    22
                ],
                [
                    "F42",
                    23
                ],
                [
                    "F6",
                    24
                ],
                [
                    "F11",
                    25
                ],
                [
                    "F34",
                    26
                ],
                [
                    "F18",
                    27
                ],
                [
                    "F17",
                    28
                ],
                [
                    "F14",
                    29
                ],
                [
                    "F41",
                    30
                ],
                [
                    "F26",
                    31
                ],
                [
                    "F19",
                    32
                ],
                [
                    "F21",
                    33
                ],
                [
                    "F23",
                    34
                ],
                [
                    "F7",
                    35
                ],
                [
                    "F43",
                    36
                ],
                [
                    "F2",
                    37
                ],
                [
                    "F31",
                    38
                ],
                [
                    "F4",
                    39
                ],
                [
                    "F12",
                    40
                ],
                [
                    "F40",
                    41
                ],
                [
                    "F36",
                    42
                ],
                [
                    "F27",
                    43
                ]
            ],
            "contradict": [
                "F15",
                "F9",
                "F20",
                "F37",
                "F5",
                "F29",
                "F32",
                "F42",
                "F6",
                "F11",
                "F34",
                "F18",
                "F14",
                "F26",
                "F19"
            ],
            "support": [
                "F24",
                "F10",
                "F28",
                "F13",
                "F16",
                "F3",
                "F30",
                "F8",
                "F38",
                "F35",
                "F25",
                "F22",
                "F33",
                "F44",
                "F39",
                "F1",
                "F17",
                "F41"
            ],
            "ignore": [
                "F21",
                "F23",
                "F7",
                "F43",
                "F2",
                "F31",
                "F4",
                "F12",
                "F40",
                "F36",
                "F27"
            ]
        },
        "narration": "C3 is the label predicted by the classifier for the given case based on the information provided. Furthermore, looking at the predicted probabilities across the other possible labels, there is little chance that any of these three labels is the true or correct one, and neither of them is. Per the attribution analysis, F15, F24, F10, and F28 are the major players in the classification, whereas F11, F34, and F18 are the least ranked among the features with contributions to the decision made by the classifier. In addition, the likelihood of the assigned label is only 63.15%, and the features responsible for this decrease in the likelihood of C3 are the negative features such as F15, F9, F20, F37, and F5, since their contributions support a different label. F24, F10, F28, F13, and F16 are on the other hand, the top positive features that strongly drive the decision in favour of the C3 label."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C1:11.57%, C2:1.49%, C3:56.87%, C4:30.07%",
        "feature_division": {
            "rank": [
                [
                    "F4",
                    0
                ],
                [
                    "F18",
                    1
                ],
                [
                    "F3",
                    2
                ],
                [
                    "F11",
                    3
                ],
                [
                    "F6",
                    4
                ],
                [
                    "F17",
                    5
                ],
                [
                    "F1",
                    6
                ],
                [
                    "F10",
                    7
                ],
                [
                    "F13",
                    8
                ],
                [
                    "F16",
                    9
                ],
                [
                    "F14",
                    10
                ],
                [
                    "F5",
                    11
                ],
                [
                    "F8",
                    12
                ],
                [
                    "F7",
                    13
                ],
                [
                    "F9",
                    14
                ],
                [
                    "F15",
                    15
                ],
                [
                    "F12",
                    16
                ],
                [
                    "F2",
                    17
                ]
            ],
            "contradict": [
                "F4",
                "F11",
                "F6",
                "F17",
                "F14",
                "F5",
                "F7",
                "F9"
            ],
            "support": [
                "F18",
                "F3",
                "F1",
                "F10",
                "F13",
                "F16",
                "F8",
                "F15"
            ],
            "ignore": [
                "F12",
                "F2"
            ]
        },
        "narration": "Among the four potential labels, C3 is identified as the most probable since its predicted probability is 56.87% higher than any of the others. The next probable label is C4 with a likelihood of 30.07%, followed by C1 and C2 with probabilities of 11.57% and 1.49%, respectively. The certainty of the prediction can be attributed to the impact of positive input features such as F18, F3, F10, and F1. In addition, the positive features are F13, F16, F8, and F15, further supporting the assignment of C3. On the contrary, shifting the prediction decision strongly in favour of one of the alternative labels is the top negative features, F4, F11, F6, F14, and F17. Finally, the attribution analysis also indicated that the values of F12 and F2 are irrelevant to the decision-making process with respect to this case."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C1:6.88%, C2:9.17%, C3:78.34%, C4:5.6%",
        "feature_division": {
            "rank": [
                [
                    "F14",
                    0
                ],
                [
                    "F41",
                    1
                ],
                [
                    "F39",
                    2
                ],
                [
                    "F21",
                    3
                ],
                [
                    "F32",
                    4
                ],
                [
                    "F34",
                    5
                ],
                [
                    "F28",
                    6
                ],
                [
                    "F3",
                    7
                ],
                [
                    "F5",
                    8
                ],
                [
                    "F7",
                    9
                ],
                [
                    "F25",
                    10
                ],
                [
                    "F19",
                    11
                ],
                [
                    "F15",
                    12
                ],
                [
                    "F1",
                    13
                ],
                [
                    "F9",
                    14
                ],
                [
                    "F38",
                    15
                ],
                [
                    "F10",
                    16
                ],
                [
                    "F31",
                    17
                ],
                [
                    "F43",
                    18
                ],
                [
                    "F29",
                    19
                ],
                [
                    "F23",
                    20
                ],
                [
                    "F20",
                    21
                ],
                [
                    "F16",
                    22
                ],
                [
                    "F12",
                    23
                ],
                [
                    "F13",
                    24
                ],
                [
                    "F42",
                    25
                ],
                [
                    "F18",
                    26
                ],
                [
                    "F4",
                    27
                ],
                [
                    "F11",
                    28
                ],
                [
                    "F26",
                    29
                ],
                [
                    "F6",
                    30
                ],
                [
                    "F36",
                    31
                ],
                [
                    "F40",
                    32
                ],
                [
                    "F30",
                    33
                ],
                [
                    "F22",
                    34
                ],
                [
                    "F24",
                    35
                ],
                [
                    "F44",
                    36
                ],
                [
                    "F27",
                    37
                ],
                [
                    "F2",
                    38
                ],
                [
                    "F17",
                    39
                ],
                [
                    "F8",
                    40
                ],
                [
                    "F37",
                    41
                ],
                [
                    "F33",
                    42
                ],
                [
                    "F35",
                    43
                ]
            ],
            "contradict": [
                "F14",
                "F28",
                "F5",
                "F7",
                "F9",
                "F43",
                "F23",
                "F16",
                "F12",
                "F13",
                "F42",
                "F18",
                "F6",
                "F36",
                "F40",
                "F30",
                "F24",
                "F44",
                "F27"
            ],
            "support": [
                "F41",
                "F39",
                "F21",
                "F32",
                "F34",
                "F3",
                "F25",
                "F19",
                "F15",
                "F1",
                "F38",
                "F10",
                "F31",
                "F29",
                "F20",
                "F4",
                "F11",
                "F26",
                "F22",
                "F2"
            ],
            "ignore": [
                "F17",
                "F8",
                "F37",
                "F33",
                "F35"
            ]
        },
        "narration": "The class label for this case is C3, among the four possible classes, with a probability of 78.34%, and since it is higher than average, the other labels are less likely. The high positive attributions of F41, F39, F21, F32, and F34 improve the odds in favour of label C3, hence they push the classification decision away from the other labels. Swinging the decision in a different direction towards one of the other labels, C1, C4, and C4, are the negative features such as F14, F28, F5, F7, F9, and F43. These features, along with other negatives like F23, F16, and F12, explain why predicted probabilities of C1, C4, and C2 are greater than 0.0%. Finally, F3, F25, and F19 are also positive features, driving the decision further higher towards C3."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C1:14.93%, C2:16.91%, C3:52.62%, C4:15.54%",
        "feature_division": {
            "rank": [
                [
                    "F16",
                    0
                ],
                [
                    "F11",
                    1
                ],
                [
                    "F9",
                    2
                ],
                [
                    "F10",
                    3
                ],
                [
                    "F17",
                    4
                ],
                [
                    "F5",
                    5
                ],
                [
                    "F19",
                    6
                ],
                [
                    "F20",
                    7
                ],
                [
                    "F12",
                    8
                ],
                [
                    "F7",
                    9
                ],
                [
                    "F25",
                    10
                ],
                [
                    "F24",
                    11
                ],
                [
                    "F13",
                    12
                ],
                [
                    "F22",
                    13
                ],
                [
                    "F23",
                    14
                ],
                [
                    "F28",
                    15
                ],
                [
                    "F2",
                    16
                ],
                [
                    "F4",
                    17
                ],
                [
                    "F26",
                    18
                ],
                [
                    "F27",
                    19
                ],
                [
                    "F29",
                    20
                ],
                [
                    "F8",
                    21
                ],
                [
                    "F3",
                    22
                ],
                [
                    "F1",
                    23
                ],
                [
                    "F21",
                    24
                ],
                [
                    "F6",
                    25
                ],
                [
                    "F14",
                    26
                ],
                [
                    "F15",
                    27
                ],
                [
                    "F18",
                    28
                ]
            ],
            "contradict": [
                "F9",
                "F10",
                "F17",
                "F5",
                "F19",
                "F20",
                "F24",
                "F13",
                "F22",
                "F23",
                "F28",
                "F27"
            ],
            "support": [
                "F16",
                "F11",
                "F12",
                "F7",
                "F25",
                "F2",
                "F4",
                "F26"
            ],
            "ignore": [
                "F29",
                "F8",
                "F3",
                "F1",
                "F21",
                "F6",
                "F14",
                "F15",
                "F18"
            ]
        },
        "narration": "The predicted likelihoods of the labels C2, C1, C3, and C4 are 16.91%, 14.93%, 52.62%, and 15.54%, meaning the most probable label is C3. The level of certainty in this prediction verdict can be attributed to the impact of the different input variables considered by the algorithm. Inspection of the contributions of the variables indicated that the contributions of F16, F11, F9, F10, F17, and F5 are higher than all the other variables. Those with moderate contributions are F19, F20, F12, F7, and F25. Among all the above-mentioned variables, F16, F11, F12, F7, and F25 are the main positive ones, increasing the odds in favour of C3. Reducing the likelihood of the C3 label in favour of a different label are the contributions of F9, F10, F17, F5, F19, and F20, which explain the probability distribution across the alternative labels. Finally, the contributions of F29, F8, F3, and F1 are irrelevant to the algorithm's decision with regard to the given case since their attributions are very close to zero."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C1:0.79%, C2:2.78%, C3:85.57%, C4:10.86%",
        "feature_division": {
            "rank": [
                [
                    "F20",
                    0
                ],
                [
                    "F10",
                    1
                ],
                [
                    "F23",
                    2
                ],
                [
                    "F16",
                    3
                ],
                [
                    "F26",
                    4
                ],
                [
                    "F25",
                    5
                ],
                [
                    "F15",
                    6
                ],
                [
                    "F11",
                    7
                ],
                [
                    "F14",
                    8
                ],
                [
                    "F21",
                    9
                ],
                [
                    "F22",
                    10
                ],
                [
                    "F17",
                    11
                ],
                [
                    "F12",
                    12
                ],
                [
                    "F13",
                    13
                ],
                [
                    "F2",
                    14
                ],
                [
                    "F19",
                    15
                ],
                [
                    "F6",
                    16
                ],
                [
                    "F4",
                    17
                ],
                [
                    "F9",
                    18
                ],
                [
                    "F8",
                    19
                ],
                [
                    "F27",
                    20
                ],
                [
                    "F24",
                    21
                ],
                [
                    "F18",
                    22
                ],
                [
                    "F28",
                    23
                ],
                [
                    "F7",
                    24
                ],
                [
                    "F5",
                    25
                ],
                [
                    "F29",
                    26
                ],
                [
                    "F3",
                    27
                ],
                [
                    "F1",
                    28
                ]
            ],
            "contradict": [
                "F23",
                "F15",
                "F11",
                "F14",
                "F21",
                "F22",
                "F17",
                "F12",
                "F13",
                "F19",
                "F8",
                "F18",
                "F28"
            ],
            "support": [
                "F20",
                "F10",
                "F16",
                "F26",
                "F25",
                "F2",
                "F6",
                "F4",
                "F9",
                "F27",
                "F24",
                "F7"
            ],
            "ignore": [
                
               
                "F5",
                "F29",
                "F3",
                "F1"
            ]
        },
        "narration": "The case under consideration here is labelled as C3 with a predicted confidence level equal to 85.57%, which is far greater than the other labels, C4, C1, and C2. The algorithm's label choice is mainly influenced by the values of F20, F10, F16, F26, and F23. Other features or variables with moderate contributions are F25, F15, F11, and F14. According to the direction of influence of the features, we can conclude that the strong positive influence of F20, F10, F16, F25, and F26 is far greater than the joint negative influence of F23, F15, F11, F14, and F21, which explains why the algorithm is relatively certain that neither C2 nor C4 nor C1 is the true label for the given case. Finally, the attribution analysis also showed that F3, F1, F5, and F29 have almost nothing to do with the decision made regarding this case under consideration."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C1:15.67%, C2:19.73%, C3:63.42%, C4:1.18%",
        "feature_division": {
            "rank": [
                [
                    "F18",
                    0
                ],
                [
                    "F6",
                    1
                ],
                [
                    "F8",
                    2
                ],
                [
                    "F14",
                    3
                ],
                [
                    "F16",
                    4
                ],
                [
                    "F13",
                    5
                ],
                [
                    "F10",
                    6
                ],
                [
                    "F5",
                    7
                ],
                [
                    "F2",
                    8
                ],
                [
                    "F11",
                    9
                ],
                [
                    "F15",
                    10
                ],
                [
                    "F7",
                    11
                ],
                [
                    "F12",
                    12
                ],
                [
                    "F1",
                    13
                ],
                [
                    "F17",
                    14
                ],
                [
                    "F9",
                    15
                ],
                [
                    "F3",
                    16
                ],
                [
                    "F4",
                    17
                ]
            ],
            "contradict": [
                "F18",
                "F13",
                "F5",
                "F11",
                "F15",
                "F12",
                "F1",
                "F17"
            ],
            "support": [
                "F6",
                "F8",
                "F14",
                "F16",
                "F10",
                "F2",
                "F7",
                "F9"
            ],
            "ignore": [
                "F3",
                "F4"
            ]
        },
        "narration": "The classification decision made by the model suggests that C3 is the true label with a confidence level of approximately 63.42%. The alternative labels, C2, C1, and C4, have their respective predicted likelihoods equal to 19.73%, 15.67%, and 1.18%. Considering the above-mentioned predicted likelihood, it is valid to conclude that the chances of C4 being the true label are very low compared to the others. The predicted likelihoods across classes are the result of the top variables F18, F6, F8, F14, F16, and F13's influences and contributions. The variables with moderate contributions are F10, F5, F2, F11, and F15, and finally, those identified as irrelevant to the decision are F3 and F4. Increasing the odds in favour of C3 are the positive contributions from F6, F8, F14, F16, F10, and F2, whereas, the contributions of F18, F13, F5, F11, and F15 contradict and support the assignment of an alternative label. In simple terms, the negative influence of the negative features is the main reason for doubt in the classification decision made by the model."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C1:0.03%, C2:5.46%, C3:59.66%, C4:34.85%",
        "feature_division": {
            "rank": [
                [
                    "F5",
                    0
                ],
                [
                    "F15",
                    1
                ],
                [
                    "F3",
                    2
                ],
                [
                    "F11",
                    3
                ],
                [
                    "F16",
                    4
                ],
                [
                    "F6",
                    5
                ],
                [
                    "F18",
                    6
                ],
                [
                    "F8",
                    7
                ],
                [
                    "F17",
                    8
                ],
                [
                    "F7",
                    9
                ],
                [
                    "F4",
                    10
                ],
                [
                    "F9",
                    11
                ],
                [
                    "F12",
                    12
                ],
                [
                    "F1",
                    13
                ],
                [
                    "F10",
                    14
                ],
                [
                    "F14",
                    15
                ],
                [
                    "F2",
                    16
                ],
                [
                    "F13",
                    17
                ]
            ],
            "contradict": [
                
                "F15",
                "F3",
                "F18",
                "F17",
                "F9",
                "F12",
                "F1",
                "F14"
            ],
            "support": [
                "F5",
                "F11",
                "F16",
                "F6",
                "F8",
                "F7",
                "F4",
                "F10",
                "F2",
                "F13"
            ],
            "ignore": [
                
            ]
        },
        "narration": "Per the values of the input variables, the algorithm outputs C3 as the most probable label, with a probability of 59.66%. C4 is the next probable label with a likelihood of 34.58%, whereas C2 and C1 have respective predictabilities of 5.46% and 0.03%. Inspecting and examining the contributions of the different variables indicated that F5, F15, F3, F11, F16, and F6 are the top ones with a higher say in the final decision, whereas F14, F2, and F13 are the least influential variables, receiving little consideration from the classifier. F15, F3, F18, F17, and F9 are the top negative features responsible for the decrease in the classifier's confidence with respect to the assigned label, and together with F12, F1, and F14, drive the classifier's labelling decision in favour of a different label, most likely C4. Despite the negative influences, the classifier still labelled the case as C3, mainly because of the positive contributions of F5, F11, F16, F6, F8, F7, F4, F10, F2, and F13."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C1:22.61%, C2:19.7%, C3:50.93%, C4:6.76%",
        "feature_division": {
            "rank": [
                [
                    "F20",
                    0
                ],
                [
                    "F18",
                    1
                ],
                [
                    "F31",
                    2
                ],
                [
                    "F32",
                    3
                ],
                [
                    "F40",
                    4
                ],
                [
                    "F41",
                    5
                ],
                [
                    "F43",
                    6
                ],
                [
                    "F33",
                    7
                ],
                [
                    "F16",
                    8
                ],
                [
                    "F44",
                    9
                ],
                [
                    "F5",
                    10
                ],
                [
                    "F38",
                    11
                ],
                [
                    "F17",
                    12
                ],
                [
                    "F13",
                    13
                ],
                [
                    "F12",
                    14
                ],
                [
                    "F29",
                    15
                ],
                [
                    "F35",
                    16
                ],
                [
                    "F25",
                    17
                ],
                [
                    "F19",
                    18
                ],
                [
                    "F28",
                    19
                ],
                [
                    "F3",
                    20
                ],
                [
                    "F26",
                    21
                ],
                [
                    "F7",
                    22
                ],
                [
                    "F15",
                    23
                ],
                [
                    "F27",
                    24
                ],
                [
                    "F39",
                    25
                ],
                [
                    "F21",
                    26
                ],
                [
                    "F23",
                    27
                ],
                [
                    "F37",
                    28
                ],
                [
                    "F30",
                    29
                ],
                [
                    "F6",
                    30
                ],
                [
                    "F22",
                    31
                ],
                [
                    "F8",
                    32
                ],
                [
                    "F42",
                    33
                ],
                [
                    "F11",
                    34
                ],
                [
                    "F2",
                    35
                ],
                [
                    "F36",
                    36
                ],
                [
                    "F14",
                    37
                ],
                [
                    "F9",
                    38
                ],
                [
                    "F4",
                    39
                ],
                [
                    "F24",
                    40
                ],
                [
                    "F10",
                    41
                ],
                [
                    "F1",
                    42
                ],
                [
                    "F34",
                    43
                ]
            ],
            "contradict": [
                "F20",
                "F41",
                "F33",
                "F16",
                "F5",
                "F35",
                "F25",
                "F28",
                "F15",
                "F27",
                "F23",
                "F37"
            ],
            "support": [
                "F18",
                "F31",
                "F32",
                "F40",
                "F43",
                "F44",
                "F38",
                "F17",
                "F13",
                "F12",
                "F29",
                "F19",
                "F3",
                "F26",
                "F7",
                "F39",
                "F21",
                "F30"
            ],
            "ignore": [
                "F6",
                "F22",
                "F8",
                "F42",
                "F11",
                "F2",
                "F36",
                "F14",
                "F9",
                "F4",
                "F24",
                "F10",
                "F1",
                "F34"
            ]
        },
        "narration": "The model's output label, based on the variables considered, is C3, since its predicted probability is the highest among the four possible class labels. The classification confidence is moderate considering the fact that it is only marginally greater than average. For this decision, the variables considered most by the model are F18, 18, F31, F32, F40, F41, and F43, while F39, F21,F37, and F23 are the least important. Among these top variables, the direction of influence of F20 and F41 suggests that they are negative variables, contradicting the decision made by the model and consequently reducing the probability of C3. Some of the other negative variables are F33, F16, F5, and F35. Countering the negative attributions and pushing the decision higher in favour of C3 are the positive variables F18, F31, F32, F40, F43, F44, and F38."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C1:11.02%, C2:6.65%, C3:63.95%, C4:18.38%",
        "feature_division": {
            "rank": [
                [
                    "F24",
                    0
                ],
                [
                    "F4",
                    1
                ],
                [
                    "F23",
                    2
                ],
                [
                    "F14",
                    3
                ],
                [
                    "F7",
                    4
                ],
                [
                    "F26",
                    5
                ],
                [
                    "F28",
                    6
                ],
                [
                    "F22",
                    7
                ],
                [
                    "F16",
                    8
                ],
                [
                    "F13",
                    9
                ],
                [
                    "F19",
                    10
                ],
                [
                    "F25",
                    11
                ],
                [
                    "F29",
                    12
                ],
                [
                    "F20",
                    13
                ],
                [
                    "F10",
                    14
                ],
                [
                    "F17",
                    15
                ],
                [
                    "F27",
                    16
                ],
                [
                    "F18",
                    17
                ],
                [
                    "F2",
                    18
                ],
                [
                    "F9",
                    19
                ],
                [
                    "F11",
                    20
                ],
                [
                    "F1",
                    21
                ],
                [
                    "F5",
                    22
                ],
                [
                    "F12",
                    23
                ],
                [
                    "F8",
                    24
                ],
                [
                    "F3",
                    25
                ],
                [
                    "F15",
                    26
                ],
                [
                    "F6",
                    27
                ],
                [
                    "F21",
                    28
                ]
            ],
            "contradict": [
                "F24",
                
                "F14",
                "F26",
                "F28",
                "F22",
                "F16",
                "F19",
                "F25",
                "F29",
                "F20",
                "F10",
                "F17",
                "F27",
                "F9",
                "F11",
                "F12",
                "F3",
                "F15"
            ],
            "support": [
                "F4",
                "F23",
                "F7",
                "F13",
                "F18",
                "F2",
                "F1",
                "F5",
                "F8",
                "F6",
                "F21"
            ],
            "ignore": [
                
                
            ]
        },
        "narration": "The label assignment decision is based mainly on the values of the input variables. The classifier outputs C3 as the most probable class label with a predicted likelihood of 63.95%, which is greater than the 18.38%, 6.65%, and 11.02% probabilities, respectively, across the alternative classes C4, C2, and C1. Analysis of the attributions of the variables showed that F24, F4, F14, F7, and F23 are the major contributors to the decision made here. Other variables with a level of influence on the decision include F26, F28, F22, F16, and F13. Among these influential variables, F4, F23, F7, and F13 are the subsets that positively contribute to the classification decision in favour of the assignment of C3. F24, F14, F26, F28, F22, and F16, on the other hand, are to blame for the classification decision's uncertainty because their negative contributions only sway the decision away from C3 and towards a different label. In fact, given that the majority of the variables of interest have negative contributions, it is not surprising that the confidence in the C3 label selection by the model is reduced to 63.95%."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:8.52%, C2:6.12%, C4:74.75%, C3:10.61%",
        "feature_division": {
            "rank": [
                [
                    "F8",
                    0
                ],
                [
                    "F15",
                    1
                ],
                [
                    "F4",
                    2
                ],
                [
                    "F18",
                    3
                ],
                [
                    "F17",
                    4
                ],
                [
                    "F24",
                    5
                ],
                [
                    "F13",
                    6
                ],
                [
                    "F22",
                    7
                ],
                [
                    "F1",
                    8
                ],
                [
                    "F6",
                    9
                ],
                [
                    "F25",
                    10
                ],
                [
                    "F9",
                    11
                ],
                [
                    "F7",
                    12
                ],
                [
                    "F3",
                    13
                ],
                [
                    "F23",
                    14
                ],
                [
                    "F21",
                    15
                ],
                [
                    "F11",
                    16
                ],
                [
                    "F12",
                    17
                ],
                [
                    "F10",
                    18
                ],
                [
                    "F20",
                    19
                ],
                [
                    "F14",
                    20
                ],
                [
                    "F19",
                    21
                ],
                [
                    "F2",
                    22
                ],
                [
                    "F16",
                    23
                ],
                [
                    "F5",
                    24
                ]
            ],
            "contradict": [
                
                "F15",
                "F18",
                "F13",
                "F6",
                "F9",
                "F7",
                "F12",
                "F10",
                "F21",
                "F11"
            ],
            "support": [
                "F8",
                "F4",
                "F17",
                "F24",
                "F22",
                "F1",
                "F25",
                "F3",
                "F23",
                "F20",
                "F14"
                
            ],
            "ignore": [
                
                "F19",
                "F2",
                "F16",
                "F5"
            ]
        },
        "narration": "The machine learning model or algorithm classifies the case under review as C4 with the predicted probability of 74.75%, meaning that it is more likely to be the true label than the other possible labels, C3, C1, and C2. Based on the predicted probabilities, there is little chance that any of the remaining labels is the right one. The confidence level associated with the decision to label the case as C4 is mainly due to the contributions of F15, F8, F4, F18, and F17. In addition, the variables F24, F13, F22, F1, F6, and F25 are shown to have moderate contributions. Regarding the direction of influence of the variables, F15, F18, F13, and F6 are the most negative ones, causing the reduction in the probability that C4 is indeed the true label. The negative variables stated in the preceeding statement, together with other negatives F9, F7, F21, F11, F12, and F10, support labelling the case as any of the alternative labels instead of C4. However, contradicting the negative variables and driving the decision higher towards C4 are the positive variables F8, F4, F17, F24, F22, and F1. In addition, F25, F3, F23, F20, and F14 also support classifying the given case as C4. Lastly, not all features are considered by the algorithm to arrive at the classification verdict for the given case, and these irrelevant variables are F19, F2, F16, and F5."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:8.52%, C2:6.12%, C4:74.75%, C3:10.61%",
        "feature_division": {
            "rank": [
                [
                    "F8",
                    0
                ],
                [
                    "F15",
                    1
                ],
                [
                    "F4",
                    2
                ],
                [
                    "F18",
                    3
                ],
                [
                    "F17",
                    4
                ],
                [
                    "F24",
                    5
                ],
                [
                    "F13",
                    6
                ],
                [
                    "F22",
                    7
                ],
                [
                    "F1",
                    8
                ],
                [
                    "F6",
                    9
                ],
                [
                    "F25",
                    10
                ],
                [
                    "F9",
                    11
                ],
                [
                    "F7",
                    12
                ],
                [
                    "F3",
                    13
                ],
                [
                    "F23",
                    14
                ],
                [
                    "F21",
                    15
                ],
                [
                    "F11",
                    16
                ],
                [
                    "F12",
                    17
                ],
                [
                    "F10",
                    18
                ],
                [
                    "F20",
                    19
                ],
                [
                    "F14",
                    20
                ],
                [
                    "F19",
                    21
                ],
                [
                    "F2",
                    22
                ],
                [
                    "F16",
                    23
                ],
                [
                    "F5",
                    24
                ]
            ],
            "contradict": [
                
                "F15",
                "F18",
                "F13",
                "F6",
                "F9",
                "F7",
                "F12",
                "F10",
                "F21",
                "F11"
            ],
            "support": [
                "F8",
                "F4",
                "F17",
                "F24",
                "F22",
                "F1",
                "F25",
                "F3",
                "F23",
                "F20",
                "F14"
                
            ],
            "ignore": [
                
                "F19",
                "F2",
                "F16",
                "F5"
            ]
        },
        "narration": "The classification model, with a predicted probability of 74.75 percent, labels the case under consideration as C4 since it is more likely to be the actual label than the other potential labels, C1, C2, and C3. Based on the predicted probability, it is possible to infer that none of the remaining labels is correct. F15, F8, F4, F18, and F17 contributed significantly to the confidence level related to the decision to classify the case as C4. Furthermore, F24, F13, F22, F1, F6, and F25 are revealed to have moderate contributions. In terms of the variables' direction of effect, F15, F18, F13, and F6 are the most negative, lowering the likelihood that C4 is the correct label. The negative variables mentioned in the above statements, along with F9, F7, F21, F11, F12, and F10, justify labelling the case as any of the alternative labels rather than C4. The positive variables F8, F4, F17, F24, F22, and F1 contradict the negative variables and drive the choice upward towards C4. Furthermore, F25, F3, F23, F20, and F14 agree that the provided case should be classified as C4. Finally, the algorithm does not evaluate all variables while determining the classification conclusion for the given case, and these useless variables are F19, F2, F16, and F5."
    },
    {
        "predicted_class": "C4",
        
        "feature_division": {
            "rank": [
                [
                    "F8",
                    1
                ],
                [
                    "F15",
                    0
                ],
                [
                    "F4",
                    2
                ],
                [
                    "F18",
                    3
                ],
                [
                    "F17",
                    4
                ],
                [
                    "F24",
                    5
                ],
                [
                    "F13",
                    6
                ],
                [
                    "F22",
                    7
                ],
                [
                    "F1",
                    8
                ],
                [
                    "F6",
                    9
                ],
                [
                    "F25",
                    10
                ],
                [
                    "F9",
                    11
                ],
                [
                    "F7",
                    12
                ],
                [
                    "F3",
                    13
                ],
                [
                    "F23",
                    14
                ],
                [
                    "F21",
                    15
                ],
                [
                    "F11",
                    16
                ],
                [
                    "F12",
                    17
                ],
                [
                    "F10",
                    18
                ],
                [
                    "F20",
                    19
                ],
                [
                    "F14",
                    20
                ],
                [
                    "F19",
                    21
                ],
                [
                    "F2",
                    22
                ],
                [
                    "F16",
                    23
                ],
                [
                    "F5",
                    24
                ]
            ],
            "contradict": [
                 "F18",
                "F13",
                "F6",
                "F9",
                "F7",
                "F12",
                "F10",
                "F21",
                "F11"
            ],
            "support": [
                "F15",
                "F8",
                "F4",
                "F17",
                "F24",
                "F22",
                "F1",
                "F25",
                "F3",
                "F23"
                
                
                
            ],
            "ignore": [
                "F20",
                "F14",
                "F19",
                "F2",
                "F16",
                "F5"
            ]
        },
        "prediction_confidence_level": "C1:8.52%, C2:0.12%, C4:80.75%, C3:10.61%", 
        "narration":"First of all, the classifier is very confident that C2 is not the true label for the case here and looking at the predicted likelihoods of the other labels C1 and C3, there is little chance that either of them is the true label. In fact, C4 is the label assigned to the case under consideration since its predicted probability equal to 80.75% is far higher than any of the other possible labels and this classification decision is based on the values of the input features. The attribution analysis indicates that F15, F8, F4, F18, and F17  are the major player resulting in the different predicted likelihoods across the classes. The other features or variables contributing perhaps moderately to the decision are F24, F13, F22, F1, F6, and F25. Critical look at the attribution map reveals that F20, F14, F19, F2, F16, and F5 have negligible or insignificant influence on the labelling decision and it can be said the model pays little attention to their values. Furthermore, pushing the decision higher towards C4 are the positive features mainly F15, F8, F4, F17, F24, and F22 together with other positives F1, F25, F23, F20, and F3. Finally, the doubt in the prediction decision here as represented by the likelihoods of C1, C3, and C2 is attributed to the negative contributions of F18, F13, F6, F9, F7, F12, F10, F21, and F11."
    
    },
    {
        "predicted_class": "C2",
        
        "feature_division": {
            "rank": [
                [
                    "F8",
                    0
                ],
                [
                    "F39",
                    1
                ],
                [
                    "F27",
                    2
                ],
                [
                    "F17",
                    3
                ],
                [
                    "F21",
                    4
                ],
                [
                    "F45",
                    5
                ],
                [
                    "F22",
                    6
                ],
                [
                    "F35",
                    7
                ],
                [
                    "F10",
                    8
                ],
                [
                    "F11",
                    9
                ],
                [
                    "F2",
                    10
                ],
                [
                    "F36",
                    11
                ],
                [
                    "F5",
                    12
                ],
                [
                    "F31",
                    13
                ],
                [
                    "F1",
                    14
                ],
                [
                    "F29",
                    15
                ],
                [
                    "F32",
                    16
                ],
                [
                    "F18",
                    17
                ],
                [
                    "F13",
                    18
                ],
                [
                    "F48",
                    19
                ],
                [
                    "F38",
                    20
                ],
                [
                    "F34",
                    21
                ],
                [
                    "F50",
                    22
                ],
                [
                    "F25",
                    23
                ],
                [
                    "F20",
                    24
                ],
                [
                    "F41",
                    25
                ],
                [
                    "F47",
                    26
                ],
                [
                    "F12",
                    27
                ],
                [
                    "F7",
                    28
                ],
                [
                    "F3",
                    29
                ],
                [
                    "F43",
                    30
                ],
                [
                    "F9",
                    31
                ],
                [
                    "F53",
                    32
                ],
                [
                    "F44",
                    33
                ],
                [
                    "F28",
                    34
                ],
                [
                    "F16",
                    35
                ],
                [
                    "F46",
                    36
                ],
                [
                    "F33",
                    37
                ],
                [
                    "F23",
                    38
                ],
                [
                    "F24",
                    39
                ],
                [
                    "F6",
                    40
                ],
                [
                    "F15",
                    41
                ],
                [
                    "F14",
                    42
                ],
                [
                    "F52",
                    43
                ],
                [
                    "F49",
                    44
                ],
                [
                    "F40",
                    45
                ],
                [
                    "F19",
                    46
                ],
                [
                    "F26",
                    47
                ],
                [
                    "F37",
                    48
                ],
                [
                    "F30",
                    49
                ],
                [
                    "F4",
                    50
                ],
                [
                    "F42",
                    51
                ],
                [
                    "F51",
                    52
                ]
            ],
            "contradict": [
                "F27",
                "F45",
                "F22",
                "F10",
                "F2",
                "F36",
                "F5",
                "F31",
                "F13",
                "F48",
                "F38",
                "F47",
                "F3",
                "F43",
                "F9",
                "F44",
                "F28",
                "F16",
                "F46",
                "F33",
                "F24",
                "F6",
                "F15",
                "F14",
                "F49",
                "F40",
                "F19",
                "F26",
                "F37"

            ],
            "support": [
                "F8",
                "F39",
                "F17",
                "F21",
                "F35",
                "F11",
                "F1",
                "F29",
                "F32",
                "F18",
                "F34",
                "F50",
                "F25",
                "F20",
                "F41",
                "F12",
                "F7",
                "F53",
                "F23",
                "F52"
            ],
            "ignore": [
                "F37",
                "F30",
                "F4",
                "F42",
                "F51"
            ]
        },
        "prediction_confidence_level": "C1:16.33%, C2:63.07%, C3: 20.60%",
        "narration":"According to the ML algorithm or model used for this classification task, the probabilities that any of the possible labels C2, C3, and C1 is the true label are 63.07%, 20.60%, and 16.33%, respectively, indicating that C2 is the most likely label here. The reason for the high inclination towards labelling the case as C2 is the values of the features such as F8, F39, F27, F17, F21, F45, F22, and F35. However, a critical look at the degree of contribution of each input feature reveals that only the values of F37, F30, F4, F42, and F51 have negligible control over the final decision made by the model, and this is mainly because their attributions are equal to zero. There is a doubt in the classification output since the likelihoods of the other labels are not equal to zero, and this can be attributed to the fact that the features such as F27, F45, F22, F10, F2, F36, F31, and F5 have negative contributions. To the contrary, the decision to allocate a higher likelihood to C2 can be attributed to the positive contributions of features such as F8, F39, F17, F21, F35, F11, and F1, which decrease the odds of the labels C1 and C3 in favour of C2. All in all, since F27 is just the negative contribution among the top influential features, F8, F39, F27, and F17, it is not strange that the model decided to label the case as C2.",
        "narration2": "The following classification statements are based on the case information supplied to the prediction model. Class C1 has a prediction probability of 36.33%, whereas class C2 has a prediction value of 63.67%. As a result, it is correct to deduce that C2 is the most likely label for the given case."
    }

    
]