[
    {
        "predicted_class": "C2",
        "prediction_confidence_level": "C1:43.04%, C2:52.26%, C3:4.7%",
        "feature_division": {
            "rank": [
                [
                    "F12",
                    0
                ],
                [
                    "F35",
                    1
                ],
                [
                    "F33",
                    2
                ],
                [
                    "F39",
                    3
                ],
                [
                    "F31",
                    4
                ],
                [
                    "F5",
                    5
                ],
                [
                    "F27",
                    6
                ],
                [
                    "F13",
                    7
                ],
                [
                    "F25",
                    8
                ],
                [
                    "F11",
                    9
                ],
                [
                    "F8",
                    10
                ],
                [
                    "F15",
                    11
                ],
                [
                    "F1",
                    12
                ],
                [
                    "F20",
                    13
                ],
                [
                    "F30",
                    14
                ],
                [
                    "F6",
                    15
                ],
                [
                    "F28",
                    16
                ],
                [
                    "F29",
                    17
                ],
                [
                    "F21",
                    18
                ],
                [
                    "F23",
                    19
                ],
                [
                    "F16",
                    20
                ],
                [
                    "F41",
                    21
                ],
                [
                    "F2",
                    22
                ],
                [
                    "F7",
                    23
                ],
                [
                    "F19",
                    24
                ],
                [
                    "F17",
                    25
                ],
                [
                    "F10",
                    26
                ],
                [
                    "F32",
                    27
                ],
                [
                    "F38",
                    28
                ],
                [
                    "F18",
                    29
                ],
                [
                    "F4",
                    30
                ],
                [
                    "F36",
                    31
                ],
                [
                    "F34",
                    32
                ],
                [
                    "F26",
                    33
                ],
                [
                    "F40",
                    34
                ],
                [
                    "F22",
                    35
                ],
                [
                    "F9",
                    36
                ],
                [
                    "F14",
                    37
                ],
                [
                    "F3",
                    38
                ],
                [
                    "F24",
                    39
                ],
                [
                    "F37",
                    40
                ]
            ],
            "contradict": [
                "F35",
                "F31",
                "F11",
                "F15",
                "F20",
                "F6",
                "F29",
                "F21",
                "F23",
                "F16",
                "F19",
                "F38",
                "F18",
                "F34",
                "F26"
            ],
            "support": [
                "F12",
                "F33",
                "F39",
                "F5",
                "F27",
                "F13",
                "F25",
                "F8",
                "F1",
                "F30",
                "F28",
                "F41",
                "F2",
                "F7",
                "F17",
                "F10",
                "F32",
                "F4",
                "F36",
                "F40",
                "F22",
                "F9"
            ],
            "ignore": [
                "F14",
                "F3",
                "F24",
                "F37"
            ]
        },
        "narration": "The label assignment decision is based mainly on the values of the input variables. The classifier outputs C2 as the most probable class label with a predicted probability of 52.26 percent, which is higher than all the other classes, C1 and C3, with their likelihoods equal to 43.04% and 4.7%, respectively. F12, F35, F31, F39, and F33 are the relevant features or variables contributing the most to this classification decision. Unfortunately, the values of F14, F3, F24, and F37 are likely ignored by the classifier when classifying the given case since their attributions are equal to zero. Notable features with moderate influence on the decision are F5, F27, F13, and F11. Regarding the direction of influence of the features, F12, F33, F39, F5, F27, and F13 are the top positive features, increasing the probability that C2 is indeed the appropriate label for the given case. Driving the prediction towards the alternative labels C3 and C1 are the negative features, mainly F11, F31, F35, F15, F6, and F29. Considering the contributions of positive and negative features, it is not surprising to see the probability distributions across the class labels C1, C2, and C3."
    },
    {
        "predicted_class": "C2",
        "prediction_confidence_level": "C1:10.96%, C2:82.96%, C3:6.08%",
        "feature_division": {
            "rank": [
                [
                    "F20",
                    0
                ],
                [
                    "F7",
                    1
                ],
                [
                    "F29",
                    2
                ],
                [
                    "F33",
                    3
                ],
                [
                    "F12",
                    4
                ],
                [
                    "F6",
                    5
                ],
                [
                    "F3",
                    6
                ],
                [
                    "F9",
                    7
                ],
                [
                    "F26",
                    8
                ],
                [
                    "F22",
                    9
                ],
                [
                    "F21",
                    10
                ],
                [
                    "F17",
                    11
                ],
                [
                    "F18",
                    12
                ],
                [
                    "F13",
                    13
                ],
                [
                    "F4",
                    14
                ],
                [
                    "F11",
                    15
                ],
                [
                    "F23",
                    16
                ],
                [
                    "F5",
                    17
                ],
                [
                    "F25",
                    18
                ],
                [
                    "F35",
                    19
                ],
                [
                    "F19",
                    20
                ],
                [
                    "F31",
                    21
                ],
                [
                    "F2",
                    22
                ],
                [
                    "F27",
                    23
                ],
                [
                    "F8",
                    24
                ],
                [
                    "F32",
                    25
                ],
                [
                    "F28",
                    26
                ],
                [
                    "F15",
                    27
                ],
                [
                    "F14",
                    28
                ],
                [
                    "F1",
                    29
                ],
                [
                    "F10",
                    30
                ],
                [
                    "F34",
                    31
                ],
                [
                    "F16",
                    32
                ],
                [
                    "F30",
                    33
                ],
                [
                    "F24",
                    34
                ]
            ],
            "contradict": [
                
                "F29",
                "F12",
                "F3",
                "F9",
                "F26",
                "F21",
                "F17",
                "F13",
                "F4",
                "F11",
                "F23",
                "F19",
                "F2",
                "F32",
                "F1",
                "F10"
                ,
                "F28",
                "F15",
                "F14"
            ],
            "support": [
                "F20",
                "F7",
                "F33",
                "F6",
                "F22",
                "F18",
                "F5",
                "F25",
                "F35",
                "F31",
                "F27",
                "F8"
            ],
            "ignore": [
                "F34",
                "F16",
                "F30",
                "F24"
            ]
        },
        "narration": "The algorithm classifies the given data or case as C2 with a likelihood of 82.96 percent, meaning that it is more likely to be the true label than the other possible labels, C1 and C3, since their respective predicted likelihoods are 10.96% and 6.08%. The confidence level associated with the decision to label the data instance as C2 is mainly due to the contributions and influences of variables such as F20, F33, F7, F12, and F29. However, the classifier did not take into account all of the input features when arriving at the abovementioned classification verdict; the features, including F34, F30, and F24, are deemed irrelevant. Investigating the attributions further showed that those features with moderate contributions are F6, F3, F22, and F9. The strong push towards labelling the given case as C2 can be attributed to the influence of the top positive features F20, F33, F7, and F6. Other positive features further increasing the certainty of the C2 prediction are F22, F18, F25, and F5. The doubt in the classification decision as represented by the probabilities of the other classes C1 and C3 is mainly due to the negative influence of F29, F12, F3, F9, and F26. In conclusion, since the combined influence of the top positive features is very high, it is not very surprising to see that C2 is predicted with a confidence level equal to 82.96%."
    },
    {
        "predicted_class": "C2",
        "prediction_confidence_level": "C3:20.79%, C2:71.38%, C1:7.82%",
        "feature_division": {
            "rank": [
                [
                    "F19",
                    0
                ],
                [
                    "F22",
                    1
                ],
                [
                    "F24",
                    2
                ],
                [
                    "F25",
                    3
                ],
                [
                    "F33",
                    4
                ],
                [
                    "F6",
                    5
                ],
                [
                    "F8",
                    6
                ],
                [
                    "F13",
                    7
                ],
                [
                    "F32",
                    8
                ],
                [
                    "F3",
                    9
                ],
                [
                    "F15",
                    10
                ],
                [
                    "F21",
                    11
                ],
                [
                    "F27",
                    12
                ],
                [
                    "F2",
                    13
                ],
                [
                    "F9",
                    14
                ],
                [
                    "F4",
                    15
                ],
                [
                    "F16",
                    16
                ],
                [
                    "F1",
                    17
                ],
                [
                    "F26",
                    18
                ],
                [
                    "F28",
                    19
                ],
                [
                    "F7",
                    20
                ],
                [
                    "F17",
                    21
                ],
                [
                    "F29",
                    22
                ],
                [
                    "F12",
                    23
                ],
                [
                    "F14",
                    24
                ],
                [
                    "F20",
                    25
                ],
                [
                    "F34",
                    26
                ],
                [
                    "F11",
                    27
                ],
                [
                    "F5",
                    28
                ],
                [
                    "F31",
                    29
                ],
                [
                    "F18",
                    30
                ],
                [
                    "F35",
                    31
                ],
                [
                    "F30",
                    32
                ],
                [
                    "F23",
                    33
                ],
                [
                    "F10",
                    34
                ]
            ],
            "contradict": [
                "F6",
                "F13",
                "F15",
                "F9",
                "F4",
                "F16",
                "F26",
                "F28",
                "F34",
                "F11",
                "F31",
                "F12",
                "F14",
                "F20",
                "F5",
                "F18"
            ],
            "support": [
                "F19",
                "F22",
                "F24",
                "F25",
                "F33",
                "F8",
                "F32",
                "F3",
                "F21",
                "F27",
                "F2",
                "F1",
                "F7",
                "F17",
                "F29"
                
            ],
            "ignore": [
                "F35",
                "F30",
                "F23",
                "F10"
            ]
        },
        "narration": "The algorithm's confidence in the assigned label, C2, is 71.38 percent, which is higher than any of the other possible labels since the next probable class label is identified as C3, with a predicted likelihood of 20.79 percent. F19, F33, F22, F24, and F25 are the features with the highest cumulative positive influence on the algorithm's decision to arrive at the abovementioned classification output verdict that C2 is the most probable label. The other positively supporting variables include F8, F32, F3, and F21. Since the likelihood of C2 is 71.38%, we can lay the blame for any uncertainty with regards to this classification on the negative variables such as F6, F13, F15, F9, and F16. This is mainly because the contributions of F6, F13, F15, F9, F26, F28, and F16 reduce the odds of having C2 as the true label in favour of labelling the given case as either C3 or C1. It is also important to note that not all the input variables are seen as important in arriving at the classification decision with respect to the case under consideration, and these irrelevant variables are F35, F30, F23, and F10."
    },
    {
        "predicted_class": "C2",
        "prediction_confidence_level": "C1:18.97%, C2:55.86%, C3:25.17%",
        "feature_division": {
            "rank": [
                [
                    "F14",
                    0
                ],
                [
                    "F3",
                    1
                ],
                [
                    "F7",
                    2
                ],
                [
                    "F1",
                    3
                ],
                [
                    "F13",
                    4
                ],
                [
                    "F15",
                    5
                ],
                [
                    "F9",
                    6
                ],
                [
                    "F10",
                    7
                ],
                [
                    "F11",
                    8
                ],
                [
                    "F8",
                    9
                ],
                [
                    "F5",
                    10
                ],
                [
                    "F4",
                    11
                ],
                [
                    "F6",
                    12
                ],
                [
                    "F12",
                    13
                ],
                [
                    "F2",
                    14
                ]
            ],
            "contradict": [
                "F1",
                "F15",
                "F10",
                "F8",
                "F5",
                "F4",
                "F2"
            ],
            "support": [
                "F14",
                "F3",
                "F7",
                "F13",
                "F9",
                "F11",
                "F6",
                "F12"
            ],
            "ignore": [
                
            ]
        },
        "narration": "The classification output observations that follow are based on the information supplied about this specific case. The class label in this case is projected to be C2 out of the three potential labels, with a likelihood of 55.86 percent, and the next likely label is C3, which has an approximate probability of 25.17 percent. The input features with values motivating the above classification output decision are mainly F14, F3, F7, F1, and F13, whilst those with the least influence on the decision are F6, F12, and F2. This implies that the features F15, F9, F10, and F11 are the ones with moderate influence on the predicted outcome for this case. Regarding the direction of influence of the features, F14, F3, F7, F13, F9, F11, F6, and F12 are the ones with positive contributions that push the model to generate C2 as the most probable label. On the contrary, the negative influence of F1, F15, F10, F8, F5, F4, and F2 shifts the decision in a different direction towards the other labels, in effect decreasing the probability that C2 is indeed the true label for the given case."
    },
    {
        "predicted_class": "C2",
        "prediction_confidence_level": "C1:9.19%, C2:79.55%, C3:11.25%",
        "feature_division": {
            "rank": [
                [
                    "F1",
                    0
                ],
                [
                    "F34",
                    1
                ],
                [
                    "F7",
                    2
                ],
                [
                    "F28",
                    3
                ],
                [
                    "F13",
                    4
                ],
                [
                    "F23",
                    5
                ],
                [
                    "F3",
                    6
                ],
                [
                    "F5",
                    7
                ],
                [
                    "F19",
                    8
                ],
                [
                    "F40",
                    9
                ],
                [
                    "F26",
                    10
                ],
                [
                    "F12",
                    11
                ],
                [
                    "F32",
                    12
                ],
                [
                    "F27",
                    13
                ],
                [
                    "F16",
                    14
                ],
                [
                    "F9",
                    15
                ],
                [
                    "F39",
                    16
                ],
                [
                    "F4",
                    17
                ],
                [
                    "F8",
                    18
                ],
                [
                    "F6",
                    19
                ],
                [
                    "F22",
                    20
                ],
                [
                    "F17",
                    21
                ],
                [
                    "F41",
                    22
                ],
                [
                    "F37",
                    23
                ],
                [
                    "F38",
                    24
                ],
                [
                    "F18",
                    25
                ],
                [
                    "F33",
                    26
                ],
                [
                    "F15",
                    27
                ],
                [
                    "F20",
                    28
                ],
                [
                    "F30",
                    29
                ],
                [
                    "F14",
                    30
                ],
                [
                    "F35",
                    31
                ],
                [
                    "F25",
                    32
                ],
                [
                    "F2",
                    33
                ],
                [
                    "F21",
                    34
                ],
                [
                    "F11",
                    35
                ],
                [
                    "F29",
                    36
                ],
                [
                    "F10",
                    37
                ],
                [
                    "F24",
                    38
                ],
                [
                    "F31",
                    39
                ],
                [
                    "F36",
                    40
                ]
            ],
            "contradict": [
                
                "F34",
                
                "F23",
                "F5",
                "F12",
                "F9",
                "F4",
                "F6",
                "F17",
                "F38",
                "F30",
                "F14",
                "F25",
                "F2",
                "F21",
                "F11",
                
                "F33",
                "F15",
                "F20",
                "F35"
            ],
            "support": [
                "F1",
                "F7",
                "F28",
                "F13",
                "F3",
                "F19",
                "F40",
                "F26",
                "F32",
                "F27",
                "F16",
                "F39",
                "F8",
                "F22",
                "F41",
                "F37",
                "F18",
                "F29"
            ],
            "ignore": [
                
                "F10",
                "F24",
                "F31",
                "F36"
            ]
        },
        "narration": "With a moderately high confidence level of 79.55%, the label for this case is identified as C2 based on the values of the input variables. According to the classification model, C3 is the next most likely class, with an 11.25 percent chance of being the true label, while C1 has a 9.19 percent chance of being the true label. The factors or features with the greatest impact on this decision are F1, F34, F7, and F28, which are followed by the moderate contributions of F13, F23, F3, F5, and F19. However, some of the features are shown to have negligible impact on the abovementioned classification output, and in fact, these are F10, F24, F36, and F31. Regarding the direction of impact of the input features, those with positive contributions driving the decision higher towards C2 are mainly F1, F7, F28, and F13. Decreasing the probability that C2 is actually the true label are the negative contributions of F34, F23, F5, F12, F9, and F4. All in all, given the fact that the majority of the most influential features have positive contributions, this explains the predicted probability of the C2 compared to that of the other labels. Specifically, only F34 has a negative contribution, favouring the alternative labels among the major contributing features: F1, F34, F7, F28, and F13."
    },
    {
        "predicted_class": "C2",
        "prediction_confidence_level": "C1:21.17%, C2:57.45%, C3:21.38%",
        "feature_division": {
            "rank": [
                [
                    "F54",
                    0
                ],
                [
                    "F27",
                    1
                ],
                [
                    "F73",
                    2
                ],
                [
                    "F1",
                    3
                ],
                [
                    "F12",
                    4
                ],
                [
                    "F60",
                    5
                ],
                [
                    "F75",
                    6
                ],
                [
                    "F46",
                    7
                ],
                [
                    "F31",
                    8
                ],
                [
                    "F7",
                    9
                ],
                [
                    "F6",
                    10
                ],
                [
                    "F50",
                    11
                ],
                [
                    "F69",
                    12
                ],
                [
                    "F20",
                    13
                ],
                [
                    "F21",
                    14
                ],
                [
                    "F65",
                    15
                ],
                [
                    "F26",
                    16
                ],
                [
                    "F40",
                    17
                ],
                [
                    "F29",
                    18
                ],
                [
                    "F43",
                    19
                ],
                [
                    "F64",
                    20
                ],
                [
                    "F80",
                    21
                ],
                [
                    "F10",
                    22
                ],
                [
                    "F28",
                    23
                ],
                [
                    "F8",
                    24
                ],
                [
                    "F81",
                    25
                ],
                [
                    "F45",
                    26
                ],
                [
                    "F15",
                    27
                ],
                [
                    "F9",
                    28
                ],
                [
                    "F66",
                    29
                ],
                [
                    "F52",
                    30
                ],
                [
                    "F34",
                    31
                ],
                [
                    "F39",
                    32
                ],
                [
                    "F74",
                    33
                ],
                [
                    "F38",
                    34
                ],
                [
                    "F30",
                    35
                ],
                [
                    "F59",
                    36
                ],
                [
                    "F44",
                    37
                ],
                [
                    "F58",
                    38
                ],
                [
                    "F5",
                    39
                ],
                [
                    "F35",
                    40
                ],
                [
                    "F32",
                    41
                ],
                [
                    "F19",
                    42
                ],
                [
                    "F71",
                    43
                ],
                [
                    "F16",
                    44
                ],
                [
                    "F3",
                    45
                ],
                [
                    "F68",
                    46
                ],
                [
                    "F13",
                    47
                ],
                [
                    "F18",
                    48
                ],
                [
                    "F77",
                    49
                ],
                [
                    "F78",
                    50
                ],
                [
                    "F57",
                    51
                ],
                [
                    "F24",
                    52
                ],
                [
                    "F47",
                    53
                ],
                [
                    "F63",
                    54
                ],
                [
                    "F37",
                    55
                ],
                [
                    "F67",
                    56
                ],
                [
                    "F62",
                    57
                ],
                [
                    "F41",
                    58
                ],
                [
                    "F4",
                    59
                ],
                [
                    "F49",
                    60
                ],
                [
                    "F2",
                    61
                ],
                [
                    "F11",
                    62
                ],
                [
                    "F61",
                    63
                ],
                [
                    "F25",
                    64
                ],
                [
                    "F42",
                    65
                ],
                [
                    "F14",
                    66
                ],
                [
                    "F22",
                    67
                ],
                [
                    "F48",
                    68
                ],
                [
                    "F79",
                    69
                ],
                [
                    "F36",
                    70
                ],
                [
                    "F56",
                    71
                ],
                [
                    "F83",
                    72
                ],
                [
                    "F72",
                    73
                ],
                [
                    "F55",
                    74
                ],
                [
                    "F82",
                    75
                ],
                [
                    "F23",
                    76
                ],
                [
                    "F33",
                    77
                ],
                [
                    "F53",
                    78
                ],
                [
                    "F70",
                    79
                ],
                [
                    "F76",
                    80
                ],
                [
                    "F51",
                    81
                ],
                [
                    "F17",
                    82
                ]
            ],
            "contradict": [
                "F54",
                "F27",
                "F46",
                "F31",
                "F7",
                "F6",
                "F50",
                "F69",
                "F20",
                "F21",
                "F26",
                "F40",
                "F8",
                "F81",
                "F9",
                "F52",
                "F34",
                "F38",
                "F59",
                "F44",
                "F5",
                "F35",
                "F32",
                "F19",
                "F13",
                "F77",
                "F24",
                "F47",
                "F63",
                "F41",
                "F4",
                "F2",
                "F25",
                "F42",
                "F22",
                "F48",
                "F79",
                "F36",
                "F56",
                "F83"
            ],
            "support": [
                "F1",
                "F73",
                "F12",
                "F60",
                "F75",
                "F65",
                "F29",
                "F43",
                "F64",
                "F80",
                "F10",
                "F28",
                "F45",
                "F15",
                "F66",
                "F39",
                "F74",
                "F30",
                "F58",
                "F71",
                "F16",
                "F3",
                "F68",
                "F18",
                "F78",
                "F57",
                "F37",
                "F67",
                "F62",
                "F49",
                "F11",
                "F61",
                "F14"
            ],
            "ignore": [
                "F72",
                "F55",
                "F82",
                "F23",
                "F33",
                "F53",
                "F70",
                "F76",
                "F51",
                "F17"
            ]
        },
        "narration": "In this instance, the label assigned is C2 with a moderate confidence level of 57.45%, whilst C3 has a likelihood of about 21.38% and that of C1 is 21.17%. The classifier's decision to label the case as C2 is primarily influenced by the attributes F54, F73, F1, and F27, whereas there are only negligible contributions from F72, F55, F82, and F23. Shifting the classification lower in the direction of C2 are the main negative variables F54, F27, F46, F31, and F7, since their contributions indicate that the true label could perhaps be either C1 or C3. On the contrary, the features firmly supporting the assignment of C2 to the given case are F1, F73, F12, F60, F75, and F65. In closing, the uncertainty in the output decision as represented by the predicted probabilities across the class labels can be attributed to the strong negative influence of the most influential features, F54 and F27."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:3.23%, C2:4.65%, C3:6.71%, C4:85.4%",
        "feature_division": {
            "rank": [
                [
                    "F16",
                    0
                ],
                [
                    "F4",
                    1
                ],
                [
                    "F15",
                    2
                ],
                [
                    "F34",
                    3
                ],
                [
                    "F31",
                    4
                ],
                [
                    "F28",
                    5
                ],
                [
                    "F35",
                    6
                ],
                [
                    "F33",
                    7
                ],
                [
                    "F20",
                    8
                ],
                [
                    "F12",
                    9
                ],
                [
                    "F26",
                    10
                ],
                [
                    "F23",
                    11
                ],
                [
                    "F7",
                    12
                ],
                [
                    "F21",
                    13
                ],
                [
                    "F10",
                    14
                ],
                [
                    "F11",
                    15
                ],
                [
                    "F18",
                    16
                ],
                [
                    "F37",
                    17
                ],
                [
                    "F13",
                    18
                ],
                [
                    "F27",
                    19
                ],
                [
                    "F36",
                    20
                ],
                [
                    "F32",
                    21
                ],
                [
                    "F17",
                    22
                ],
                [
                    "F9",
                    23
                ],
                [
                    "F2",
                    24
                ],
                [
                    "F1",
                    25
                ],
                [
                    "F14",
                    26
                ],
                [
                    "F24",
                    27
                ],
                [
                    "F22",
                    28
                ],
                [
                    "F29",
                    29
                ],
                [
                    "F19",
                    30
                ],
                [
                    "F38",
                    31
                ],
                [
                    "F30",
                    32
                ],
                [
                    "F8",
                    33
                ],
                [
                    "F3",
                    34
                ],
                [
                    "F5",
                    35
                ],
                [
                    "F25",
                    36
                ],
                [
                    "F6",
                    37
                ]
            ],
            "contradict": [
                "F4",
                "F34",
                
                "F33",
                "F12",
                "F23",
                "F21",
                "F18",
                "F13",
                "F27",
                "F2",
                "F24",
                "F29",
                "F19",
                "F38",
                "F3"
            ],
            "support": [
                "F16",
                "F15",
                "F35",
                "F31",
                "F28",
                "F20",
                "F26",
                "F7",
                "F10",
                "F11",
                "F37",
                "F36",
                "F32",
                "F17",
                "F9",
                "F1",
                "F14",
                "F22",
                "F30",
                "F8"
            ],
            "ignore": [
                "F5",
                "F25",
                "F6"
            ]
        },
        "narration": "The model classifies the case under consideration as C4 with a predicted confidence level of 85.4 percent, which is far greater than the other possible labels. The label selection is mainly due to the contributions of F4, F15, F34, F31, and F16, but conversely, the three variables F5, F25, and F6 are shown to have negligible contributions or influence on the model. The variables that are regarded as moderately important are F28, F35, F33, F12, and F20. Examining the attributions of all the relevant features indicated that the ones with negative impact or contribution resulting in a reduction in the likelihood of C4 being the true label for the case under consideration are mainly F4, F34, F33, F23, and F12. Positively driving the decision higher towards C4 and increasing its likelihood are the contributions of F16, F15, F35, F31, and F28. In closing, the certainty associated with the assigned label can be explained away by considering the fact that the joint positive influence of F16, F15, and F31 is higher than that of the top negative features, F4, F34, and F33."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:8.67%, C2:5.45%, C3:7.92%, C4:77.95%",
        "feature_division": {
            "rank": [
                [
                    "F11",
                    0
                ],
                [
                    "F10",
                    1
                ],
                [
                    "F6",
                    2
                ],
                [
                    "F9",
                    3
                ],
                [
                    "F8",
                    4
                ],
                [
                    "F3",
                    5
                ],
                [
                    "F15",
                    6
                ],
                [
                    "F7",
                    7
                ],
                [
                    "F4",
                    8
                ],
                [
                    "F12",
                    9
                ],
                [
                    "F17",
                    10
                ],
                [
                    "F18",
                    11
                ],
                [
                    "F1",
                    12
                ],
                [
                    "F13",
                    13
                ],
                [
                    "F19",
                    14
                ],
                [
                    "F5",
                    15
                ],
                [
                    "F16",
                    16
                ],
                [
                    "F14",
                    17
                ],
                [
                    "F2",
                    18
                ]
            ],
            "contradict": [
                "F6",
                "F9",
                "F8",
                "F15",
                "F7",
                "F12",
                "F17",
                "F18",
                "F13",
                "F19",
                "F5",
                "F16",
                "F14"
            ],
            "support": [
                "F11",
                "F10",
                "F3",
                "F4",
                "F1"
            ],
            "ignore": [
                "F2"
            ]
        },
        "narration": "With a probability of roughly 77.95%, the predictive algorithm identifies the case under evaluation as C4; however, there is about an 8.67% chance of the true label being C1, a 5.45% chance that it is C2, and a 7.92% chance that it is C3. The attribution analysis indicates that F11, F6, F9, F8, and F10 are primarily responsible for the assignment and classification decisions above. Other features with a moderate level of influence on the decision include F3, F15, F4, and F7, whilst the value of F2 is given very little weight when choosing the right label for the given case. The marginal uncertainty with respect to the label assignment for this case can be attributed to the negative contributions of F6, F8, F9, F15, F7, and F12 since they influence the decision to shift towards one of the least probable labels. Across all the input features, we can see that those increasing the probability that C4 is indeed the true label for this case are F11, F10, F3, F4, and F1."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:11.12%, C2:4.08%, C3:16.34%, C4:68.46%",
        "feature_division": {
            "rank": [
                [
                    "F31",
                    0
                ],
                [
                    "F25",
                    1
                ],
                [
                    "F15",
                    2
                ],
                [
                    "F5",
                    3
                ],
                [
                    "F23",
                    4
                ],
                [
                    "F10",
                    5
                ],
                [
                    "F9",
                    6
                ],
                [
                    "F33",
                    7
                ],
                [
                    "F17",
                    8
                ],
                [
                    "F35",
                    9
                ],
                [
                    "F26",
                    10
                ],
                [
                    "F22",
                    11
                ],
                [
                    "F34",
                    12
                ],
                [
                    "F4",
                    13
                ],
                [
                    "F16",
                    14
                ],
                [
                    "F32",
                    15
                ],
                [
                    "F27",
                    16
                ],
                [
                    "F6",
                    17
                ],
                [
                    "F2",
                    18
                ],
                [
                    "F28",
                    19
                ],
                [
                    "F19",
                    20
                ],
                [
                    "F24",
                    21
                ],
                [
                    "F1",
                    22
                ],
                [
                    "F29",
                    23
                ],
                [
                    "F14",
                    24
                ],
                [
                    "F21",
                    25
                ],
                [
                    "F3",
                    26
                ],
                [
                    "F30",
                    27
                ],
                [
                    "F20",
                    28
                ],
                [
                    "F18",
                    29
                ],
                [
                    "F12",
                    30
                ],
                [
                    "F8",
                    31
                ],
                [
                    "F13",
                    32
                ],
                [
                    "F11",
                    33
                ],
                [
                    "F7",
                    34
                ]
            ],
            "contradict": [
                
                
                "F5",
                "F10",
                "F33",
                "F16",
                "F6",
                "F2",
                "F19",
                "F24",
                "F1",
                "F29",
                "F14",
                "F21",
                "F3",
                "F30"
            ],
            "support": [
                "F31",
                "F25",
                "F15",
                "F23",
                "F9",
                "F17",
                "F35",
                "F26",
                "F22",
                "F34",
                "F4",
                "F32",
                "F27",
                "F28",
                "F20",
                "F18",
                "F12"
            ],
            "ignore": [
                "F8",
                "F13",
                "F11",
                "F7"
            ]
        },
        "narration": "The classification decision made by the model is that C4 is the most probable label with a confidence level of 68.46%, which is far higher than any of the remaining labels C3, C2, and C1. Aside from the features F13, F8, F11, and F7, which have insignificant influence on the above decision, all the other input features are shown to either positively or negatively support the classification outcome. The top features increasing the probability that C4 is the appropriate label for the given case are F31, F25, F15, and F23. Conversely, the negative influences of F5, F10, F33, F6, and F16 indicate that it is possible that the true label could be different from the generated label, resulting in the likelihoods associated with C2, C1, and C3. In conclusion, the certainty in the C4 assignment can be attributed to the fact that the top features, F31, F25, and F15, have a positive influence or impact on the model."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:0.29%, C2:19.42%, C3:3.36%, C4:76.93%",
        "feature_division": {
            "rank": [
                [
                    "F22",
                    0
                ],
                [
                    "F11",
                    1
                ],
                [
                    "F13",
                    2
                ],
                [
                    "F2",
                    3
                ],
                [
                    "F19",
                    4
                ],
                [
                    "F21",
                    5
                ],
                [
                    "F4",
                    6
                ],
                [
                    "F17",
                    7
                ],
                [
                    "F10",
                    8
                ],
                [
                    "F5",
                    9
                ],
                [
                    "F14",
                    10
                ],
                [
                    "F16",
                    11
                ],
                [
                    "F24",
                    12
                ],
                [
                    "F8",
                    13
                ],
                [
                    "F9",
                    14
                ],
                [
                    "F18",
                    15
                ],
                [
                    "F15",
                    16
                ],
                [
                    "F7",
                    17
                ],
                [
                    "F1",
                    18
                ],
                [
                    "F3",
                    19
                ],
                [
                    "F23",
                    20
                ],
                [
                    "F20",
                    21
                ],
                [
                    "F6",
                    22
                ],
                [
                    "F12",
                    23
                ]
            ],
            "contradict": [
                
                "F2",
                "F19",
                "F4",
                "F10",
                "F5",
                "F14",
                "F16",
                "F24",
                "F8",
                "F18",
                "F1",
                "F20"
            ],
            "support": [
                "F22",
                "F11",
                "F13",
                "F21",
                "F17",
                "F9",
                "F15",
                "F7",
                "F3",
                "F23"
            ],
            "ignore": [
                "F6",
                "F12"
            ]
        },
        "narration": "The case under consideration here was labelled C4 by the classification model with a fairly high confidence level equal to 76.93%, while the next probable class, C2, has a likelihood of 19.42%, which is far less than that of C4. The decision to label the case as C4 is mainly based on the values of F22, F11, F13, F2, F19, and F21, whereas the values of F6 and F12 are basically not relevant for the decision made. Regarding the direction of influence of the variables, those with the strongest positive contributions that increase the odds in favour of C4 are F22, F11, and F13. The remaining positive variables moderately pushing the decision higher towards C4 include F21, F9, F17, and F15, whereas the least ranked positive variables are F7, F3, and F2. Covertly, the top negative variables F2, F19, F4, and F10 are driving the prediction away from the C4 label with their negative influence supported by the other notable negative variables F14, F5, F16, and F24. In closing, the fairly strong push towards labelling the case as C4 can be explained away by considering the fact that the top three variables, F22, F13, and F11, all have positive contributions supporting the assignment of C4."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:11.86%, C2:1.9%, C3:14.71%, C4:71.53%",
        "feature_division": {
            "rank": [
                [
                    "F14",
                    0
                ],
                [
                    "F11",
                    1
                ],
                [
                    "F16",
                    2
                ],
                [
                    "F43",
                    3
                ],
                [
                    "F23",
                    4
                ],
                [
                    "F5",
                    5
                ],
                [
                    "F47",
                    6
                ],
                [
                    "F18",
                    7
                ],
                [
                    "F32",
                    8
                ],
                [
                    "F46",
                    9
                ],
                [
                    "F52",
                    10
                ],
                [
                    "F48",
                    11
                ],
                [
                    "F17",
                    12
                ],
                [
                    "F20",
                    13
                ],
                [
                    "F13",
                    14
                ],
                [
                    "F4",
                    15
                ],
                [
                    "F45",
                    16
                ],
                [
                    "F7",
                    17
                ],
                [
                    "F1",
                    18
                ],
                [
                    "F22",
                    19
                ],
                [
                    "F15",
                    20
                ],
                [
                    "F35",
                    21
                ],
                [
                    "F50",
                    22
                ],
                [
                    "F33",
                    23
                ],
                [
                    "F28",
                    24
                ],
                [
                    "F41",
                    25
                ],
                [
                    "F19",
                    26
                ],
                [
                    "F10",
                    27
                ],
                [
                    "F27",
                    28
                ],
                [
                    "F34",
                    29
                ],
                [
                    "F24",
                    30
                ],
                [
                    "F49",
                    31
                ],
                [
                    "F25",
                    32
                ],
                [
                    "F12",
                    33
                ],
                [
                    "F2",
                    34
                ],
                [
                    "F44",
                    35
                ],
                [
                    "F26",
                    36
                ],
                [
                    "F51",
                    37
                ],
                [
                    "F37",
                    38
                ],
                [
                    "F8",
                    39
                ],
                [
                    "F42",
                    40
                ],
                [
                    "F29",
                    41
                ],
                [
                    "F3",
                    42
                ],
                [
                    "F36",
                    43
                ],
                [
                    "F53",
                    44
                ],
                [
                    "F6",
                    45
                ],
                [
                    "F38",
                    46
                ],
                [
                    "F21",
                    47
                ],
                [
                    "F40",
                    48
                ],
                [
                    "F30",
                    49
                ],
                [
                    "F39",
                    50
                ],
                [
                    "F31",
                    51
                ],
                [
                    "F9",
                    52
                ]
            ],
            "contradict": [
                
                "F16",
                "F43",
                "F18",
                "F32",
                "F48",
                "F17",
                "F20",
                "F45",
                "F7",
                "F1",
                "F22",
                "F35",
                "F28",
                "F19",
                "F24",
                "F49",
                "F44",
                "F51",
                "F37",
                "F8",
                "F42",
                "F3",
                "F36",
                "F6"
            ],
            "support": [
                "F14",
                "F11",
                "F23",
                "F5",
                "F47",
                "F46",
                "F52",
                "F13",
                "F4",
                "F15",
                "F50",
                "F33",
                "F41",
                "F10",
                "F27",
                "F34",
                "F25",
                "F12",
                "F2",
                "F26",
                "F29",
                "F53",
                "F38",
                "F21",
                "F40"
            ],
            "ignore": [
                
                "F30",
                "F39",
                "F31",
                "F9"
            ]
        },
        "narration": "The most probable label for this case, as indicated by the predicted probabilities across the class labels, is C4, since its likelihood is 71.53%. The classification decision for this case is mainly influenced by the values of F14, F16, F11, F23, and F34, while on the other hand, the values of F30, F39, F9, and F31 are identified as irrelevant to the final decision here. Among the influential variables, those with very high positive contributions in favour of the output label are F11, F14, F23, and F5. In contrast, F16, F43, F18, and F32 are shown to be the top negative variables, shifting the decision away from C4 in favour of the other labels. The variables with moderate positive influence include F47, F46, F52, and F13, whereas the moderately negative ones include F48, F17, and F20. Looking at the ranking of the variables based on their contributions, it is not surprising that the decision is to label the case as C4, but the contributions of F16 and F43 explain the little doubt about the correctness of the assigned label."
    },
    {
        "predicted_class": "C2",
        "prediction_confidence_level": "C1:7.16%, C2:93.83%, C3:0.01%",
        "feature_division": {
            "rank": [
                [
                    "F49",
                    0
                ],
                [
                    "F51",
                    1
                ],
                [
                    "F52",
                    2
                ],
                [
                    "F48",
                    3
                ],
                [
                    "F23",
                    4
                ],
                [
                    "F47",
                    5
                ],
                [
                    "F43",
                    6
                ],
                [
                    "F60",
                    7
                ],
                [
                    "F14",
                    8
                ],
                [
                    "F19",
                    9
                ],
                [
                    "F13",
                    10
                ],
                [
                    "F59",
                    11
                ],
                [
                    "F20",
                    12
                ],
                [
                    "F7",
                    13
                ],
                [
                    "F27",
                    14
                ],
                [
                    "F58",
                    15
                ],
                [
                    "F26",
                    16
                ],
                [
                    "F2",
                    17
                ],
                [
                    "F34",
                    18
                ],
                [
                    "F12",
                    19
                ],
                [
                    "F8",
                    20
                ],
                [
                    "F18",
                    21
                ],
                [
                    "F21",
                    22
                ],
                [
                    "F54",
                    23
                ],
                [
                    "F3",
                    24
                ],
                [
                    "F35",
                    25
                ],
                [
                    "F41",
                    26
                ],
                [
                    "F25",
                    27
                ],
                [
                    "F45",
                    28
                ],
                [
                    "F42",
                    29
                ],
                [
                    "F22",
                    30
                ],
                [
                    "F39",
                    31
                ],
                [
                    "F44",
                    32
                ],
                [
                    "F9",
                    33
                ],
                [
                    "F32",
                    34
                ],
                [
                    "F16",
                    35
                ],
                [
                    "F56",
                    36
                ],
                [
                    "F36",
                    37
                ],
                [
                    "F30",
                    38
                ],
                [
                    "F33",
                    39
                ],
                [
                    "F29",
                    40
                ],
                [
                    "F28",
                    41
                ],
                [
                    "F40",
                    42
                ],
                [
                    "F11",
                    43
                ],
                [
                    "F15",
                    44
                ],
                [
                    "F4",
                    45
                ],
                [
                    "F57",
                    46
                ],
                [
                    "F55",
                    47
                ],
                [
                    "F61",
                    48
                ],
                [
                    "F10",
                    49
                ],
                [
                    "F17",
                    50
                ],
                [
                    "F37",
                    51
                ],
                [
                    "F38",
                    52
                ],
                [
                    "F6",
                    53
                ],
                [
                    "F50",
                    54
                ],
                [
                    "F24",
                    55
                ],
                [
                    "F1",
                    56
                ],
                [
                    "F46",
                    57
                ],
                [
                    "F5",
                    58
                ],
                [
                    "F31",
                    59
                ],
                [
                    "F53",
                    60
                ]
            ],
            "contradict": [
                "F43",
                "F60",
                "F19",
                "F13",
                "F59",
                "F20",
                "F7",
                "F27",
                "F26",
                "F34",
                "F12",
                "F8",
                "F18",
                "F35",
                "F25",
                "F45",
                "F42",
                "F39",
                "F36",
                "F30",
                "F29",
                "F28",
                "F11",
                "F15",
                "F55",
                "F10",
                "F17",
                "F38",
                "F6"
            ],
            "support": [
                "F49",
                "F52",
                "F23",
                "F51",
                "F48",
                "F47",
                "F14",
                "F58",
                "F2",
                "F21",
                "F54",
                "F3",
                "F41",
                "F22",
                "F44",
                "F9",
                "F32",
                "F16",
                "F56",
                "F33",
                "F40",
                "F4",
                "F57",
                "F61",
                "F37",
                "F50"
            ],
            "ignore": [
                "F24",
                "F1",
                "F46",
                "F5",
                "F31",
                "F53"
            ]
        },
        "narration": "With a very high confidence level of approximately 93.83%, the algorithm labels the case under consideration as C2, implying that neither of the remaining labels, C3 or C1, is the true label here. The variables with the most say in the abovementioned classification verdict are F49, F51, F52, and F48 but on the contrary, those with negligible or irrelevant contributions to the case under consideration here include F24, F1, F46, and F5. By virtue of the fact that the respective attributions of F24, F1, F46, and F5 are very close to zero when determining the correct label for the given case, it is valid to assert that not all the features have either positive or negative contributions. The marginal uncertainty in the decision made here could be attributed to the influence of negative variables such as F43, F60, F19, F59, and F13. The abovementioned negative variables together with F20, F7, and F27 support labelling the case as one of the other labels instead of C2. Overall, the very high confidence level in the prediction decision can be explained by comparing the joint positive influence of F49, F51, F52, F23, F48, and F47 to that of all the previously mentioned negative variables."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:20.03%, C2:11.4%, C3:7.31%, C4:61.26%",
        "feature_division": {
            "rank": [
                [
                    "F19",
                    0
                ],
                [
                    "F35",
                    1
                ],
                [
                    "F40",
                    2
                ],
                [
                    "F15",
                    3
                ],
                [
                    "F27",
                    4
                ],
                [
                    "F17",
                    5
                ],
                [
                    "F1",
                    6
                ],
                [
                    "F25",
                    7
                ],
                [
                    "F36",
                    8
                ],
                [
                    "F38",
                    9
                ],
                [
                    "F37",
                    10
                ],
                [
                    "F10",
                    11
                ],
                [
                    "F4",
                    12
                ],
                [
                    "F26",
                    13
                ],
                [
                    "F24",
                    14
                ],
                [
                    "F5",
                    15
                ],
                [
                    "F29",
                    16
                ],
                [
                    "F9",
                    17
                ],
                [
                    "F13",
                    18
                ],
                [
                    "F8",
                    19
                ],
                [
                    "F31",
                    20
                ],
                [
                    "F16",
                    21
                ],
                [
                    "F11",
                    22
                ],
                [
                    "F28",
                    23
                ],
                [
                    "F18",
                    24
                ],
                [
                    "F20",
                    25
                ],
                [
                    "F41",
                    26
                ],
                [
                    "F7",
                    27
                ],
                [
                    "F39",
                    28
                ],
                [
                    "F21",
                    29
                ],
                [
                    "F30",
                    30
                ],
                [
                    "F33",
                    31
                ],
                [
                    "F32",
                    32
                ],
                [
                    "F6",
                    33
                ],
                [
                    "F34",
                    34
                ],
                [
                    "F22",
                    35
                ],
                [
                    "F2",
                    36
                ],
                [
                    "F14",
                    37
                ],
                [
                    "F23",
                    38
                ],
                [
                    "F12",
                    39
                ],
                [
                    "F3",
                    40
                ]
            ],
            "contradict": [
                "F19",
                "F27",
                "F17",
                "F25",
                "F38",
                "F10",
                "F29",
                "F9",
                "F13",
                "F8",
                "F16",
                "F11",
                "F18",
                "F41",
                "F39",
                "F33",
                "F32",
                "F6",
                "F34"
            ],
            "support": [
                "F35",
                "F40",
                "F15",
                "F1",
                "F36",
                "F37",
                "F4",
                "F26",
                "F24",
                "F5",
                "F31",
                "F28",
                "F20",
                "F7",
                "F21",
                "F30",
                "F22",
                "F2"
            ],
            "ignore": [
                "F14",
                "F23",
                "F12",
                "F3"
            ]
        },
        "narration": "The algorithm's confidence in the assigned label, C4, is 61.26%, which is higher than any of the other possible labels given that the next likely class label is identified as C1, with a predicted probability of just 20.03%, which is followed by C2 and C3 with likelihoods of 11.4% and 7.31%, respectively. The variables with the most significant contributions are F19, F35, F40, F15, F27, and F17, however, the algorithm did not take into consideration all of the input features when arriving at the abovementioned classification verdict; the variables, including F14, F3, F12, and F23, are deemed irrelevant. Increasing the probability that C4 is indeed the true label are the top positive variables, F35, F40, F15, F1, and F36. Conversely, the negative variables such as F19, F27, F17, F38, and F25 have contributions or influences that shift the decision away from C4, casting doubt on the correctness of the prediction outcome. Other negative variables contributing to the decrease in the likelihood of C4 include F10, F29, F9, and F13, whereas the other positive variables increasing the odds of C4 include F37, F4, F26, F24, and F5. In essence, the high confidence in the assigned label can be attributed to the influence of positive variables such as F35, F15, and F40, which are shown to contradict the negative influences of F19, F27, and F17."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C1:3.16%, C2:0.0%, C3:96.84%",
        "feature_division": {
            "rank": [
                [
                    "F5",
                    0
                ],
                [
                    "F18",
                    1
                ],
                [
                    "F21",
                    2
                ],
                [
                    "F4",
                    3
                ],
                [
                    "F15",
                    4
                ],
                [
                    "F10",
                    5
                ],
                [
                    "F3",
                    6
                ],
                [
                    "F7",
                    7
                ],
                [
                    "F11",
                    8
                ],
                [
                    "F6",
                    9
                ],
                [
                    "F12",
                    10
                ],
                [
                    "F16",
                    11
                ],
                [
                    "F2",
                    12
                ],
                [
                    "F17",
                    13
                ],
                [
                    "F22",
                    14
                ],
                [
                    "F24",
                    15
                ],
                [
                    "F23",
                    16
                ],
                [
                    "F13",
                    17
                ],
                [
                    "F8",
                    18
                ],
                [
                    "F9",
                    19
                ],
                [
                    "F1",
                    20
                ],
                [
                    "F20",
                    21
                ],
                [
                    "F14",
                    22
                ],
                [
                    "F19",
                    23
                ]
            ],
            "contradict": [
                "F10",
                "F3",
                "F7",
                "F16",
                "F2",
                "F22",
                "F8",
                "F9"
            ],
            "support": [
                "F5",
                "F18",
                "F21",
                "F4",
                "F15",
                "F11",
                "F6",
                "F12",
                "F17",
                "F24",
                "F23",
                "F13"
            ],
            "ignore": [
                "F14",
                "F19",
                "F20",
                "F1"
            ]
        },
        "narration": "The predicted label for this case is C3, with a very high confidence level of 96.84%, and because it is far higher than average, the other labels are less likely, especially C2. F5, F18, F21, and F4 are the variables or features that have the largest influence on the above-mentioned classification conclusion. However, when arriving at the above-mentioned class assignment for the given case, the model is shown to not take into consideration all of the input features; F19, F1, F20, and F14 are regarded as irrelevant. Positively motivating the model to output the C3 label are the variables such as F5, F18, F21, F4, and F15, while on the other hand, F10, F7, F3, F16, and F2 indicate that perhaps there is a chance that C3 is not the true label. The very small doubt in the decision as represented by the predicted probability of C1 can be blamed on the negative variables mentioned above. In closing, since there are more variables with a strong positive influence on the decision, it is not surprising that the confidence level is that high."
    },
    {
        "predicted_class": "C2",
        "prediction_confidence_level": "C1:37.23%, C2:49.46%, C3:13.31%",
        "feature_division": {
            "rank": [
                [
                    "F28",
                    0
                ],
                [
                    "F12",
                    1
                ],
                [
                    "F39",
                    2
                ],
                [
                    "F1",
                    3
                ],
                [
                    "F35",
                    4
                ],
                [
                    "F26",
                    5
                ],
                [
                    "F37",
                    6
                ],
                [
                    "F23",
                    7
                ],
                [
                    "F43",
                    8
                ],
                [
                    "F9",
                    9
                ],
                [
                    "F2",
                    10
                ],
                [
                    "F25",
                    11
                ],
                [
                    "F32",
                    12
                ],
                [
                    "F30",
                    13
                ],
                [
                    "F34",
                    14
                ],
                [
                    "F33",
                    15
                ],
                [
                    "F16",
                    16
                ],
                [
                    "F41",
                    17
                ],
                [
                    "F42",
                    18
                ],
                [
                    "F14",
                    19
                ],
                [
                    "F31",
                    20
                ],
                [
                    "F15",
                    21
                ],
                [
                    "F20",
                    22
                ],
                [
                    "F36",
                    23
                ],
                [
                    "F40",
                    24
                ],
                [
                    "F29",
                    25
                ],
                [
                    "F8",
                    26
                ],
                [
                    "F5",
                    27
                ],
                [
                    "F24",
                    28
                ],
                [
                    "F13",
                    29
                ],
                [
                    "F18",
                    30
                ],
                [
                    "F19",
                    31
                ],
                [
                    "F38",
                    32
                ],
                [
                    "F11",
                    33
                ],
                [
                    "F17",
                    34
                ],
                [
                    "F27",
                    35
                ],
                [
                    "F3",
                    36
                ],
                [
                    "F7",
                    37
                ],
                [
                    "F22",
                    38
                ],
                [
                    "F4",
                    39
                ],
                [
                    "F21",
                    40
                ],
                [
                    "F6",
                    41
                ],
                [
                    "F10",
                    42
                ]
            ],
            "contradict": [
                "F28",
                "F12",
                "F39",
                "F26",
                "F23",
                "F43",
                "F9",
                "F2",
                "F30",
                "F34",
                "F16",
                "F14",
                "F15",
                "F40",
                "F29",
                "F8",
                "F11",
                "F7"
            ],
            "support": [
                "F1",
                "F35",
                "F37",
                "F25",
                "F32",
                "F33",
                "F41",
                "F42",
                "F31",
                "F20",
                "F36",
                "F5",
                "F24",
                "F13",
                "F18",
                "F19",
                "F38",
                "F17",
                "F27",
                "F3"
            ],
            "ignore": [
                "F22",
                "F4",
                "F21",
                "F6",
                "F10"
            ]
        },
        "narration": "The label selection decision is based mainly on the values of the input variables passed to the classifier. The classifier outputs C2 as the most probable class label with a predicted probability of 49.46 percent, which is higher than all the other classes, C1 and C3, with their likelihoods equal to 37.23 percent and 13.31 percent, respectively. F28, F12, F39, F35, and F1 are the relevant features or variables playing a major role in this classification outcome. However, the attribution analysis also revealed that F22, F4, F10, F21, and F6 can be considered irrelevant to the decision since their attributions or impacts are negligible. F23, F43, F26, and F37 are some of the variables with a moderate impact on the classification decision. It is concerning that the difference between the likelihood of C2 and C1 is smaller than expected and that the variables contributing to the doubt in the assigned label include F28, F12, F39, F23, F43, and F26. On the contrary, those increasing the belief in the correctness of C2 are the positive variables such as F1, F35, F37, F25, and F32. In essence, since the top three variables, F28, F12, and F39, have negative contributions, it is not surprising to have such probabilities associated with the other classes, C1 and C3."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:13.3%, C2:0.3%, C3:7.67%, C4:78.74%",
        "feature_division": {
            "rank": [
                [
                    "F9",
                    0
                ],
                [
                    "F3",
                    1
                ],
                [
                    "F13",
                    2
                ],
                [
                    "F8",
                    3
                ],
                [
                    "F14",
                    4
                ],
                [
                    "F6",
                    5
                ],
                [
                    "F11",
                    6
                ],
                [
                    "F5",
                    7
                ],
                [
                    "F7",
                    8
                ],
                [
                    "F4",
                    9
                ],
                [
                    "F2",
                    10
                ],
                [
                    "F10",
                    11
                ],
                [
                    "F1",
                    12
                ],
                [
                    "F12",
                    13
                ],
                [
                    "F15",
                    14
                ]
            ],
            "contradict": [
                "F13",
                "F8",
                "F6",
                "F11",
                "F10",
                "F5"
            ],
            "support": [
                "F9",
                "F3",
                "F14",
                "F7",
                "F4",
                "F2"
            ],
            "ignore": [
                "F1",
                "F12",
                "F15"
            ]
        },
        "narration": "In this case, the prediction output states that the label has to be C4 among the four possible classes, with a probability of 78.74%. However, looking at the predicted probabilities across the other labels, it is clear why the classifier is quite certain that not all the labels are the right ones, and they are those with the least confidence level, such as C2 and C3. The most relevant features driving the classification above are F9, F3, F13, and F8, while those irrelevant to the decision are mainly F12, F1, and F15. Notable positive features increasing the probability of the C4 prediction are F9, F3, F14, and F7, while notable negatives driving the decision in a different direction are F13, F8, F6, and F11. When you take into consideration the ordering of the features based on the magnitude of their contributions or influences, it is very obvious why the decision was made to label the case as C4 instead of either C2 or C3 or C1."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:5.2%, C2:2.43%, C3:2.92%, C4:89.46%",
        "feature_division": {
            "rank": [
                [
                    "F73",
                    0
                ],
                [
                    "F33",
                    1
                ],
                [
                    "F24",
                    2
                ],
                [
                    "F70",
                    3
                ],
                [
                    "F23",
                    4
                ],
                [
                    "F40",
                    5
                ],
                [
                    "F39",
                    6
                ],
                [
                    "F44",
                    7
                ],
                [
                    "F15",
                    8
                ],
                [
                    "F8",
                    9
                ],
                [
                    "F46",
                    10
                ],
                [
                    "F53",
                    11
                ],
                [
                    "F3",
                    12
                ],
                [
                    "F14",
                    13
                ],
                [
                    "F69",
                    14
                ],
                [
                    "F27",
                    15
                ],
                [
                    "F65",
                    16
                ],
                [
                    "F10",
                    17
                ],
                [
                    "F28",
                    18
                ],
                [
                    "F67",
                    19
                ],
                [
                    "F66",
                    20
                ],
                [
                    "F43",
                    21
                ],
                [
                    "F72",
                    22
                ],
                [
                    "F25",
                    23
                ],
                [
                    "F7",
                    24
                ],
                [
                    "F29",
                    25
                ],
                [
                    "F5",
                    26
                ],
                [
                    "F6",
                    27
                ],
                [
                    "F2",
                    28
                ],
                [
                    "F71",
                    29
                ],
                [
                    "F52",
                    30
                ],
                [
                    "F19",
                    31
                ],
                [
                    "F47",
                    32
                ],
                [
                    "F21",
                    33
                ],
                [
                    "F62",
                    34
                ],
                [
                    "F4",
                    35
                ],
                [
                    "F36",
                    36
                ],
                [
                    "F37",
                    37
                ],
                [
                    "F35",
                    38
                ],
                [
                    "F42",
                    39
                ],
                [
                    "F31",
                    40
                ],
                [
                    "F68",
                    41
                ],
                [
                    "F56",
                    42
                ],
                [
                    "F60",
                    43
                ],
                [
                    "F54",
                    44
                ],
                [
                    "F20",
                    45
                ],
                [
                    "F41",
                    46
                ],
                [
                    "F18",
                    47
                ],
                [
                    "F11",
                    48
                ],
                [
                    "F55",
                    49
                ],
                [
                    "F45",
                    50
                ],
                [
                    "F59",
                    51
                ],
                [
                    "F50",
                    52
                ],
                [
                    "F26",
                    53
                ],
                [
                    "F16",
                    54
                ],
                [
                    "F12",
                    55
                ],
                [
                    "F1",
                    56
                ],
                [
                    "F34",
                    57
                ],
                [
                    "F58",
                    58
                ],
                [
                    "F51",
                    59
                ],
                [
                    "F57",
                    60
                ],
                [
                    "F32",
                    61
                ],
                [
                    "F48",
                    62
                ],
                [
                    "F61",
                    63
                ],
                [
                    "F64",
                    64
                ],
                [
                    "F13",
                    65
                ],
                [
                    "F30",
                    66
                ],
                [
                    "F63",
                    67
                ],
                [
                    "F49",
                    68
                ],
                [
                    "F9",
                    69
                ],
                [
                    "F17",
                    70
                ],
                [
                    "F38",
                    71
                ],
                [
                    "F22",
                    72
                ]
            ],
            "contradict": [
                
                "F40",
                "F8",
                "F53",
                "F14",
                "F10",
                "F67",
                "F7",
                "F5",
                "F2",
                "F71",
                "F52",
                "F19",
                "F47",
                "F21",
                "F62",
                "F37",
                "F35",
                "F42",
                "F68",
                "F56",
                "F20",
                "F41",
                "F11",
                "F55",
                "F45",
                "F50",
                "F34",
                "F57",
                "F61",
                "F13",
                "F30",
                "F63"
            ],
            "support": [
                "F73",
                "F33",
                "F24",
                "F23",
                "F70",
                "F39",
                "F44",
                "F15",
                "F46",
                "F3",
                "F69",
                "F27",
                "F65",
                "F28",
                "F66",
                "F43",
                "F72",
                "F25",
                "F29",
                "F6",
                "F4",
                "F36",
                "F31",
                "F60",
                "F54",
                "F18",
                "F59",
                "F26",
                "F16",
                "F12",
                "F1",
                "F58",
                "F51",
                "F32",
                "F48",
                "F49",
                "F64"
            ],
            "ignore": [
                "F9",
                "F17",
                "F38",
                "F22"
            ]
        },
        "narration": "With such a high likelihood of 89.46%, the label for this case out of the four potential classes is judged to be C4. However, looking at the predicted probabilities across the other possible labels, it is clear why the classifier is very certain that not all the labels are the right ones, and they are those with the least confidence. The classification decision with regard to the given case is mainly influenced by the values of F73, F33, F24, and F70. But checking out the attributions of the variables showed that F17, F9, F22, and F38 have negligible influence on the classification decision with respect to the case under consideration here. Furthermore, the analysis indicates that F40, F8, F53, F10, and F14 are largely responsible for the predicted likelihoods across the alternative labels since their contributions only sway the decision away from C4 and towards a different label. Other negative variables, F67, F7, F5, and F2, are also responsible for the marginal uncertainty associated with the prediction of C4. Conversely, the contributions of F73, F33, F24, F23, and F70 increase the probability that C4 is indeed the true label for this case, and this decision towards C4 is further supported by F39, F44, F15, and F46."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:13.42%, C2:4.92%, C3:0.68%, C4:80.98%",
        "feature_division": {
            "rank": [
                [
                    "F13",
                    0
                ],
                [
                    "F4",
                    1
                ],
                [
                    "F11",
                    2
                ],
                [
                    "F1",
                    3
                ],
                [
                    "F7",
                    4
                ],
                [
                    "F8",
                    5
                ],
                [
                    "F12",
                    6
                ],
                [
                    "F14",
                    7
                ],
                [
                    "F6",
                    8
                ],
                [
                    "F5",
                    9
                ],
                [
                    "F15",
                    10
                ],
                [
                    "F10",
                    11
                ],
                [
                    "F3",
                    12
                ],
                [
                    "F2",
                    13
                ],
                [
                    "F9",
                    14
                ]
                ,
                [
                    "F16",
                    15
                ]
            ],
            "contradict": [
                
                "F1",
                "F7",
                "F12",
                "F8",
                "F10",
                "F3",
                "F9",
                "F16"
            ],
            "support": [
                "F13",
                "F4",
                "F11",
                "F14",
                "F6",
                "F5",
                "F15",
                "F2"
            ],
            "ignore": [
               
            ]
        },
        "narration": "Per the values of the input variables, the algorithm outputs C4 as the most probable label, with a confidence level equal to 80.98%. It is important to note, however, that there is a 13.42% possibility of it being C1, a 0.68% chance that C3 is the true label, and a 4.92% chance that it is rather C2. The attribution analysis shows that F13, F4, F11, and F1 are the top variables, resulting in the predicted likelihoods across the classes. The other variables with moderate contributions are F7, F8, F12, and F14, whereas the least ranked variables are F2, F9, and F16. The analysis also revealed that the variables with negative contributions to the prediction include F1, F7, F8, F10, and F12, hence reducing the likelihood of the assigned label. On the other hand, the variables with positive contributions to the decision are primarily F13, F4, F11, F14, F6, and F5. In closing, the fairly high confidence level in the decision is as a result of the fact that the top three variables, F13, F4, and F11, all have a positive impact on the decision."
    },
    {
        "predicted_class": "C4",
        "prediction_confidence_level": "C1:9.73%, C2:1.45%, C3:25.64%, C4:63.17%",
        "feature_division": {
            "rank": [
                [
                    "F7",
                    0
                ],
                [
                    "F3",
                    1
                ],
                [
                    "F17",
                    2
                ],
                [
                    "F11",
                    3
                ],
                [
                    "F6",
                    4
                ],
                [
                    "F19",
                    5
                ],
                [
                    "F2",
                    6
                ],
                [
                    "F18",
                    7
                ],
                [
                    "F10",
                    8
                ],
                [
                    "F9",
                    9
                ],
                [
                    "F15",
                    10
                ],
                [
                    "F5",
                    11
                ],
                [
                    "F12",
                    12
                ],
                [
                    "F8",
                    13
                ],
                [
                    "F1",
                    14
                ],
                [
                    "F16",
                    15
                ],
                [
                    "F14",
                    16
                ],
                [
                    "F13",
                    17
                ],
                [
                    "F4",
                    18
                ]
            ],
            "contradict": [
                "F7",
                "F17",
                "F19",
                "F18",
                "F10",
                "F5",
                "F8"
            ],
            "support": [
                "F3",
                "F11",
                "F6",
                "F2",
                "F9",
                "F15",
                "F12"
            ],
            "ignore": [
                "F1",
                "F16",
                "F14",
                "F13",
                "F4"
            ]
        },
        "narration": "The classification model's confidence in the assigned label, C4, is 63.17%, higher than any of the other possible labels, given that the next probable label, C3, has a likelihood of 25.64%. F7, F17, and F3 are the major contributors to the above mentioned classification output, but the values of F4, F16, F1, F14, and F13 have negligible influence on the decision made here. In terms of the direction of the contributions of the influential features, the positive ones increasing the prediction likelihood of the C4 label are mainly F3, F11, F6, and F2. Contradicting the decision in favour of the other labels are the negative features such as F7, F17, F19, and F18 since they are shifting the decision away from C4. Moderately improving the validity of label C4 are the other positive features, F9, F15, and F12, whereas F10, F5, and F8 are the remaining negative features. To summarize, the strong negative impact of F7 and F17 explains why the confidence level with respect to this label assignment is reduced to just 63.17% as opposed to having a much higher certainty."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C1:35.12%, C2:8.24%, C3:46.29%, C4:10.35%",
        "feature_division": {
            "rank": [
                [
                    "F18",
                    0
                ],
                [
                    "F17",
                    1
                ],
                [
                    "F6",
                    2
                ],
                [
                    "F2",
                    3
                ],
                [
                    "F13",
                    4
                ],
                [
                    "F7",
                    5
                ],
                [
                    "F16",
                    6
                ],
                [
                    "F10",
                    7
                ],
                [
                    "F12",
                    8
                ],
                [
                    "F3",
                    9
                ],
                [
                    "F9",
                    10
                ],
                [
                    "F5",
                    11
                ],
                [
                    "F15",
                    12
                ],
                [
                    "F19",
                    13
                ],
                [
                    "F11",
                    14
                ],
                [
                    "F14",
                    15
                ],
                [
                    "F8",
                    16
                ],
                [
                    "F4",
                    17
                ],
                [
                    "F1",
                    18
                ]
            ],
            "contradict": [
                "F18",
                "F2",
                "F10",
                "F3",
                "F9",
                "F15",
                "F19",
                "F14",
                "F8",
                "F4"
            ],
            "support": [
                "F17",
                "F6",
                "F13",
                "F7",
                "F16",
                "F12",
                "F5",
                "F11"
            ],
            "ignore": [
                "F1"
            ]
        },
        "narration": "The labelling decision with respect to the given case is that C3 has a 46.29% chance of being the true label, whilst the likelihoods of the other labels, C1, C4, and C2 are 35.12%, 10.35%, and 8.24%, respectively. Therefore, we can conclude that the certainty in the C3 assignment is lower than expected and that the very strong negative influence of F18 can be blamed for that. Further shifting the decision away from C3 are the remaining negative variables, F2, F10, F3, and F9. The positive influences of F17, F6, F13, F7, and F16 are the ones driving the decision higher towards the C3 label. F12, F5, and F11 are the remaining positively influential variables, further improving the odds in favour of C3. Finally, the value of F1 is shown to have a negligible contribution to the decision since its attribution is closer to zero than any of the input variables."
    },
    {
        "predicted_class": "C3",
        "prediction_confidence_level": "C1:12.55%, C3:76.0%, C2:11.45%",
        "feature_division": {
            "rank": [
                [
                    "F18",
                    0
                ],
                [
                    "F31",
                    1
                ],
                [
                    "F32",
                    2
                ],
                [
                    "F39",
                    3
                ],
                [
                    "F34",
                    4
                ],
                [
                    "F35",
                    5
                ],
                [
                    "F25",
                    6
                ],
                [
                    "F29",
                    7
                ],
                [
                    "F45",
                    8
                ],
                [
                    "F27",
                    9
                ],
                [
                    "F28",
                    10
                ],
                [
                    "F42",
                    11
                ],
                [
                    "F16",
                    12
                ],
                [
                    "F20",
                    13
                ],
                [
                    "F4",
                    14
                ],
                [
                    "F1",
                    15
                ],
                [
                    "F46",
                    16
                ],
                [
                    "F11",
                    17
                ],
                [
                    "F22",
                    18
                ],
                [
                    "F10",
                    19
                ],
                [
                    "F52",
                    20
                ],
                [
                    "F49",
                    21
                ],
                [
                    "F51",
                    22
                ],
                [
                    "F7",
                    23
                ],
                [
                    "F21",
                    24
                ],
                [
                    "F19",
                    25
                ],
                [
                    "F40",
                    26
                ],
                [
                    "F33",
                    27
                ],
                [
                    "F48",
                    28
                ],
                [
                    "F30",
                    29
                ],
                [
                    "F12",
                    30
                ],
                [
                    "F24",
                    31
                ],
                [
                    "F17",
                    32
                ],
                [
                    "F2",
                    33
                ],
                [
                    "F36",
                    34
                ],
                [
                    "F43",
                    35
                ],
                [
                    "F41",
                    36
                ],
                [
                    "F8",
                    37
                ],
                [
                    "F44",
                    38
                ],
                [
                    "F38",
                    39
                ],
                [
                    "F47",
                    40
                ],
                [
                    "F15",
                    41
                ],
                [
                    "F13",
                    42
                ],
                [
                    "F53",
                    43
                ],
                [
                    "F3",
                    44
                ],
                [
                    "F6",
                    45
                ],
                [
                    "F14",
                    46
                ],
                [
                    "F26",
                    47
                ],
                [
                    "F9",
                    48
                ],
                [
                    "F37",
                    49
                ],
                [
                    "F5",
                    50
                ],
                [
                    "F23",
                    51
                ],
                [
                    "F50",
                    52
                ]
            ],
            "contradict": [
                "F31",
                
                "F29",
                "F28",
                "F42",
                "F16",
                "F20",
                "F4",
                "F46",
                "F11",
                "F49",
                "F51",
                "F21",
                "F17",
                "F36",
                "F43",
                "F24",
                "F2",
                "F41"
            ],
            "support": [
                "F18",
                "F32",
                "F39",
                "F34",
                "F35",
                "F25",
                "F45",
                "F27",
                "F1",
                "F22",
                "F10",
                "F52",
                "F7",
                "F19",
                "F40",
                "F33",
                "F48",
                "F30",
                "F12"
                
            ],
            "ignore": [
                "F8",
                "F44",
                "F38",
                "F47",
                "F15",
                "F13",
                "F53",
                "F3",
                "F6",
                "F14",
                "F26",
                "F9",
                "F37",
                "F5",
                "F23",
                "F50"
            ]
        },
        "narration": "The breakdown of the likelihoods across the classes C1, C2, and C3 is 12.55%, 11.45%, and 76.0%, respectively, which implies C3 is the most likely label. F31, F32, F18, and F39 are the features with the most influence on the predicted probabilities across the three classes, while those with moderate influence are F34, F35, F25, F29, and F45. When it comes to assigning a label to this case, the algorithm paid little attention to the respective values of F8, F44, F38, and F47, which are regarded as irrelevant to their respective contributions. Examining the attribution analysis revealed that the variables increasing the probability that C3 is not the true label are the negative variables such as F31, F29, F28, F42, F16, and F20. On the contrary, the positive contributions from F18, F32, F39, F34, F35, and F25 motivate the assignment of the C3 label for the case under consideration. The other variables increasing the probability that C3 is the true label include F27, F45, F1, and F22, whereas those moderately decreasing the odds of C3 include F4, F6, F11, and F49. The contributions of the negative and positive variables explain why the algorithm is not 100.0% certain about the labelling verdict here, but 76.0% is a good confidence level."
    }

]